{
  "backend/main.mo": "Defines types and state maps for residents, vitals, MAR, ADL, and access control, with authorization checks and resident management logic.",
  "feature_evidence.json": "Feature evidence report linking a branding update to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing frontend components, pages, utilities, hooks, and styles across the app.",
  "frontend/index.css": "Global Tailwind-based style definitions including OKLCH color variables for light/dark themes and base styling.",
  "frontend/index.html": "HTML entry point setting up the Maui Lane Care Home app with photo-based favicon and manifest links.",
  "frontend/public/site.webmanifest": "Web manifest defining app name, icons, theme colors, and standalone display mode.",
  "frontend/src/App.tsx": "Root React app configuring router routes, ProtectedGate authentication wrapper, React Query, and toast notifications.",
  "frontend/src/components/auth/ProtectedGate.tsx": "Authentication gate that shows a login card with branding when unauthenticated and renders children when logged in.",
  "frontend/src/components/brand/BrandLogo.tsx": "Logo component that resolves BRAND.logoPath with BASE_URL and falls back to initials if image loading fails.",
  "frontend/src/components/maui/MauiAppShell.tsx": "App shell providing header with logo, navigation, routed content, and footer, with sign-out clearing identity and cache.",
  "frontend/src/components/maui/MauiNav.tsx": "Simple navigation bar showing only the Dashboard link with active state highlighting.",
  "frontend/src/components/maui/residents/AddNewResidentDialog.tsx": "Dialog component that manages a full resident creation form, including nested fields, validation cleanup, and mutation submission.",
  "frontend/src/components/maui/residents/adl/AddAdlRecordDialog.tsx": "Dialog for adding ADL records with required-field validation, identity checks, and mutation submission.",
  "frontend/src/components/maui/residents/adl/AdlHistoryList.tsx": "Displays a resident’s ADL records with sorting, deletion, and loading/empty states.",
  "frontend/src/components/maui/residents/adl/index.ts": "Re‑exports ADL dialog and history list components.",
  "frontend/src/components/maui/residents/EditResidentInformationDialog.tsx": "Dialog for editing resident information with validation, physician list management, and save handling.",
  "frontend/src/components/maui/residents/mar/AddMarRecordDialog.tsx": "Form dialog for creating MAR records, including medication selection, validation, and submission.",
  "frontend/src/components/maui/residents/mar/index.ts": "Re‑exports MAR dialog and history list components.",
  "frontend/src/components/maui/residents/mar/MarHistoryList.tsx": "Lists and sorts MAR records with formatted timestamps and delete functionality.",
  "frontend/src/components/maui/residents/medications/AddMedicationDialog.tsx": "Dialog for adding a medication with dosage, route, times, physician, and notes.",
  "frontend/src/components/maui/residents/medications/index.ts": "Re‑exports the AddMedicationDialog component.",
  "frontend/src/components/maui/residents/ResidentCard.tsx": "Displays resident info in a card with actions for viewing, toggling status, and deleting via confirmation dialog.",
  "frontend/src/components/maui/residents/ResidentDashboardHeader.tsx": "Header section for the resident dashboard with title text and an add-resident button.",
  "frontend/src/components/maui/residents/ResidentFilterSortBar.tsx": "Filter and sort bar allowing room-based filtering and sorting by room, name, or age.",
  "frontend/src/components/maui/residents/ResidentGrid.tsx": "Grid layout that renders ResidentCard components or an empty state message when no residents match filters.",
  "frontend/src/components/maui/residents/ResidentKpiRow.tsx": "Shows KPI cards summarizing total, active, and discharged residents.",
  "frontend/src/components/maui/residents/ResidentStatusTabs.tsx": "Tabs for switching between All, Active, and Discharged resident views.",
  "frontend/src/components/maui/residents/vitals/RecordDailyVitalsDialog.tsx": "Dialog for recording daily vitals with validation, Fahrenheit conversion, and form submission.",
  "frontend/src/components/maui/residents/vitals/VitalsHistoryList.tsx": "Displays a resident's vitals history with sorting, status indicators, loading states, and deletion via mutations.",
  "frontend/src/components/references/MissingReferencePlaceholder.tsx": "Renders a placeholder card listing missing reference materials with a link to the full checklist.",
  "frontend/src/hooks/residentQueryKeys.ts": "Provides scoped React Query keys for resident directory operations based on principal identity.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, login flow, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for user profiles, residents, vitals, and other records.",
  "frontend/src/index.css": "Defines Tailwind-based global styles, theming variables, and print styles for the application.",
  "frontend/src/lib/brand.ts": "Exports branding constants such as app name and logo path.",
  "frontend/src/lib/utils.ts": "Provides a utility function for merging Tailwind classnames.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/maui/Dashboard.tsx": "Main resident dashboard fetching backend data, applying filters/sorting, computing KPIs, and rendering grid and dialogs.",
  "frontend/src/pages/maui/residents/mockResidentMedications.ts": "Provides mock medication records for residents, including a special case for resident ID 3.",
  "frontend/src/pages/maui/residents/mockResidentProfileData.ts": "Defines resident profile and medication types and supplies fallback mock profile data.",
  "frontend/src/pages/maui/residents/mockResidents.ts": "Mock list of residents with basic attributes like room, status, physicians, and medication counts.",
  "frontend/src/pages/maui/residents/residentDirectoryViewModel.ts": "Maps backend resident records to UI view models with computed age and formatted room strings.",
  "frontend/src/pages/maui/residents/residentListUtils.ts": "Utility functions for filtering, sorting, KPI computation, and listing unique rooms for residents.",
  "frontend/src/pages/maui/residents/ResidentProfile.tsx": "Displays a resident’s profile with vitals, MAR, ADL, medications, editing, and print options using backend or mock data.",
  "frontend/src/pages/maui/residents/ResidentProfilePrintReport.tsx": "Print-only component generating a formatted resident profile report with personal info, insurance, and medications.",
  "frontend/src/pages/references/MoritzReferenceCapture.tsx": "UI page listing all required reference assets and screenshots needed to recreate the application's design.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routes), persist them in sessionStorage, and clear them from the URL or storage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugins for the frontend UI theme.",
  "project_state.json": "Describes the project’s current state, versions, and implemented features for a Maui Lane Care Home app based on an existing ICP + React scaffold."
}