{
  "backend/main.mo": "Defines an empty Motoko actor with no methods or state.",
  "feature_evidence.json": "Contains a feature evidence report documenting a logo-loading fix in MauiAppShell.tsx with associated files, components, and metadata.",
  "frontend-file-summaries.txt": "Lists prewritten summaries of multiple frontend source files for reference or build documentation.",
  "frontend/index.css": "Defines global Tailwind CSS layers and OKLCH-based color variables for light and dark themes, applying them across base elements.",
  "frontend/index.html": "HTML entry point setting page metadata and linking the favicon and main script with BASE_URL-safe asset paths.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, wraps the app in React Query and an authentication gate, and renders MauiAppShell as the root layout.",
  "frontend/src/components/auth/ProtectedGate.tsx": "Authentication wrapper that shows a login screen using Internet Identity when unauthenticated and renders children when logged in.",
  "frontend/src/components/maui/MauiAppShell.tsx": "Layout shell that renders the header with a base-URL-safe logo loader, navigation, routed content, and footer with sign‑out support.",
  "frontend/src/components/maui/MauiNav.tsx": "Simple navigation bar showing a single Dashboard link with active-state styling.",
  "frontend/src/components/maui/residents/AddNewResidentDialog.tsx": "Modal dialog providing a large multi-section form for entering new resident data and submitting a simplified resident record.",
  "frontend/src/components/maui/residents/EditResidentInformationDialog.tsx": "Form dialog for editing resident details with validation, physician management, and save handling.",
  "frontend/src/components/maui/residents/ResidentCard.tsx": "Displays a resident's summary with actions to view profile, toggle status, and delete with confirmation.",
  "frontend/src/components/maui/residents/ResidentDashboardHeader.tsx": "Header section for the resident dashboard with title and add-resident button.",
  "frontend/src/components/maui/residents/ResidentFilterSortBar.tsx": "Filter and sort controls for residents by room and various sort options.",
  "frontend/src/components/maui/residents/ResidentGrid.tsx": "Grid layout that renders ResidentCard components or an empty-state message.",
  "frontend/src/components/maui/residents/ResidentKpiRow.tsx": "Shows KPI cards for total, active, and discharged residents.",
  "frontend/src/components/maui/residents/ResidentStatusTabs.tsx": "Tabs for filtering residents by status: All, Active, or Discharged.",
  "frontend/src/components/references/MissingReferencePlaceholder.tsx": "Placeholder card listing missing reference materials with links and categorized items.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages a backend actor based on Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, identity loading, and status management.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future backend-related React Query hooks.",
  "frontend/src/index.css": "Configures Tailwind layers, defines light/dark theme CSS variables, applies global styles, and includes print-specific formatting rules.",
  "frontend/src/lib/utils.ts": "Provides a utility function to merge and normalize Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/maui/Dashboard.tsx": "Implements the residents dashboard with filtering, sorting, KPIs, and add/delete/status update functionality.",
  "frontend/src/pages/maui/residents/mockResidentMedications.ts": "Provides mock medication data and a function returning medications by resident ID.",
  "frontend/src/pages/maui/residents/mockResidentProfileData.ts": "Generates mock detailed resident profile data based on basic resident entries, including physicians, contacts, and insurance.",
  "frontend/src/pages/maui/residents/mockResidents.ts": "Defines mock resident list entries used for dashboard and profile features.",
  "frontend/src/pages/maui/residents/residentListUtils.ts": "Contains helper functions for filtering, sorting, and computing KPIs for resident lists.",
  "frontend/src/pages/maui/residents/ResidentProfile.tsx": "Displays detailed resident profile data with edit, print, and medication interactions using mock data sources.",
  "frontend/src/pages/maui/residents/ResidentProfilePrintReport.tsx": "Renders a print-only resident profile report including personal info, insurance details, and medication tables.",
  "frontend/src/pages/references/MoritzReferenceCapture.tsx": "React page that lists screenshot and design reference requirements using UI components and categorized sections.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "JSON file describing the project state, version, and a list of existing features with metadata."
}