{
  "backend/main.mo": "Defines backend actor types for residents, vitals, medication, ADL, physicians, pharmacy, insurance, and directory responses, and initializes authorization mixin.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "JSON-like list summarizing all frontend files and their roles in routing, UI components, hooks, utilities, and styling.",
  "frontend/docs/rollback-to-v46.md": "Guide outlining verification steps, deployment process, smoke tests, and troubleshooting for rolling back to version 46.",
  "frontend/index.css": "Defines global Tailwind CSS variables and themes for light/dark modes using OKLCH values and base styling.",
  "frontend/index.html": "HTML entry point setting app version, metadata, icons, and loading the main TypeScript module.",
  "frontend/public/site.webmanifest": "PWA manifest specifying app name, icons, theme colors, and display mode.",
  "frontend/public/version.txt": "Contains the version marker value '46'.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router routes and wrapping the app with auth gate and query provider.",
  "frontend/src/components/auth/ProtectedGate.tsx": "Auth gate that initializes Internet Identity and shows a login screen or protected content based on identity state.",
  "frontend/src/components/brand/BrandLogo.tsx": "Logo component that attempts multiple URL variants for the brand image and falls back to initials if loading fails.",
  "frontend/src/components/maui/MauiAppShell.tsx": "Defines the main app shell with header, navigation, routed content, and footer, including sign‑out handling.",
  "frontend/src/components/maui/MauiNav.tsx": "Renders the primary navigation bar with active‑route highlighting for the dashboard.",
  "frontend/src/components/maui/residents/AddNewResidentDialog.tsx": "Provides a dialog for creating a new resident with extensive form state, validation, and nested field handling.",
  "frontend/src/components/maui/residents/adl/AddAdlRecordDialog.tsx": "Modal form for creating ADL records with validation, identity checks, and submission via mutation.",
  "frontend/src/components/maui/residents/adl/AdlHistoryList.tsx": "Displays, sorts, and deletes ADL records, showing placeholders and empty-state UI.",
  "frontend/src/components/maui/residents/adl/index.ts": "Re-exports ADL dialog and history list components.",
  "frontend/src/components/maui/residents/EditResidentInformationDialog.tsx": "Displays a dialog for editing resident details, supporting dynamic lists of physicians and responsible persons.",
  "frontend/src/components/maui/residents/mar/AddMarRecordDialog.tsx": "Modal form for adding MAR records tied to a resident’s active medications with validation and mutation calls.",
  "frontend/src/components/maui/residents/mar/index.ts": "Re-exports MAR dialog and history list components.",
  "frontend/src/components/maui/residents/mar/MarHistoryList.tsx": "Lists, sorts, and allows deletion of MAR records with date/time formatting and empty-state UI.",
  "frontend/src/components/maui/residents/medications/AddMedicationDialog.tsx": "Dialog form for adding a resident medication with dynamic times, validation, and callback-based submission.",
  "frontend/src/components/maui/residents/medications/index.ts": "Re-exports the AddMedicationDialog component.",
  "frontend/src/components/maui/residents/ResidentCard.tsx": "Shows a resident summary card with status, metrics, profile navigation, and delete confirmation.",
  "frontend/src/components/maui/residents/ResidentDashboardHeader.tsx": "Renders the resident management section header with an action button to add new residents.",
  "frontend/src/components/maui/residents/ResidentFilterSortBar.tsx": "Provides room filtering and sorting controls for the resident list.",
  "frontend/src/components/maui/residents/ResidentGrid.tsx": "Displays residents in a card grid layout with empty‑state handling.",
  "frontend/src/components/maui/residents/ResidentKpiRow.tsx": "Shows KPI cards for total, active, and discharged residents.",
  "frontend/src/components/maui/residents/ResidentStatusTabs.tsx": "Renders tabs for filtering residents by All, Active, or Discharged status.",
  "frontend/src/components/maui/residents/vitals/RecordDailyVitalsDialog.tsx": "Form dialog for entering daily vital signs, validating inputs, creating a vitals record, and submitting it via a mutation.",
  "frontend/src/components/maui/residents/vitals/VitalsHistoryList.tsx": "Lists recorded vitals for a resident with sorting, status indicators, and delete functionality using queries and mutations.",
  "frontend/src/components/references/MissingReferencePlaceholder.tsx": "UI component that displays required missing reference materials with categorized lists and a link to the full checklist.",
  "frontend/src/hooks/residentQueryKeys.ts": "Provides centralized factory functions for generating scoped React Query keys for resident-related data.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useHealthCheck.ts": "Runs a timed health check against the backend using an anonymous actor and exposes reachability status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages ICP Internet Identity authentication, providing identity state, login/logout actions, and restoring identities across reloads.",
  "frontend/src/hooks/useQueries.ts": "Contains all app-level React Query hooks for user profiles, residents directory, and vitals/records operations using the authenticated actor.",
  "frontend/src/index.css": "Defines Tailwind base layers, custom light/dark theme CSS variables, and print-specific styles.",
  "frontend/src/lib/brand.ts": "Exports static branding info including facility name and logo path.",
  "frontend/src/lib/utils.ts": "Provides a utility function to merge Tailwind and conditional class names.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/maui/Dashboard.tsx": "Implements the residents dashboard with filtering, sorting, KPIs, and backend interactions.",
  "frontend/src/pages/maui/residents/mockResidentMedications.ts": "Provides mock medication data for residents based on ID.",
  "frontend/src/pages/maui/residents/mockResidentProfileData.ts": "Defines resident profile interfaces and fallback mock data when backend data is unavailable.",
  "frontend/src/pages/maui/residents/mockResidents.ts": "Contains mock resident directory entries with basic demographics and counts.",
  "frontend/src/pages/maui/residents/residentAge.ts": "Provides helper functions to calculate and format a resident’s age from a birthdate.",
  "frontend/src/pages/maui/residents/residentDirectoryViewModel.ts": "Maps backend resident types to lightweight UI view models, including age calculation and room formatting helpers.",
  "frontend/src/pages/maui/residents/residentListUtils.ts": "Provides filtering, sorting, KPI calculations, and room extraction utilities for resident view models.",
  "frontend/src/pages/maui/residents/ResidentProfile.tsx": "Displays and edits a resident’s profile with tabs for vitals, MAR, ADLs, and medications, using backend or mock data.",
  "frontend/src/pages/maui/residents/ResidentProfilePrintReport.tsx": "Renders a print‑optimized resident profile report including demographics and medications.",
  "frontend/src/pages/references/MoritzReferenceCapture.tsx": "Renders a reference checklist page outlining required screenshots and design assets for recreating the UI.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, clearing, and managing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugin setup.",
  "project_state.json": "Project state metadata describing architecture, existing features, known issues, and build context."
}