{
  "backend/main.mo": "Defines resident-related data types, authorization mixin usage, and in-memory maps for residents, user profiles, and health records with access checks and resident management entrypoints.",
  "feature_evidence.json": "Feature evidence report listing frontend files, components, and test IDs associated with resident profile edit functionality and update flows.",
  "frontend-file-summaries.txt": "Contains prewritten one‑sentence summaries for numerous frontend files including routing, UI components, hooks, utilities, and pages.",
  "frontend/index.css": "Tailwind base layer defining global OKLCH color tokens, dark mode overrides, and shared component styling.",
  "frontend/index.html": "Minimal HTML entry point setting the app title and loading the React main.tsx script.",
  "frontend/src/App.tsx": "Sets up TanStack Router and React Query, wraps the app with authentication and toast providers, and defines core routes.",
  "frontend/src/components/auth/ProtectedGate.tsx": "Authentication gate that shows a branded login screen when unauthenticated and renders children when identity is present.",
  "frontend/src/components/maui/MauiAppShell.tsx": "Application shell providing header, navigation, main outlet, and footer with sign‑out logic that clears identity and cached data.",
  "frontend/src/components/maui/MauiNav.tsx": "Simple navigation bar rendering a single Dashboard link with active state highlighting.",
  "frontend/src/components/maui/residents/AddNewResidentDialog.tsx": "Dialog component for creating a new resident with form state, nested field handlers, validation, and submission via useCreateResident.",
  "frontend/src/components/maui/residents/adl/AddAdlRecordDialog.tsx": "Dialog for adding an ADL record with validation, identity checks, and submission via useCreateAdlRecord.",
  "frontend/src/components/maui/residents/adl/AdlHistoryList.tsx": "Displays a resident’s ADL record history with sorting, deletion, and loading/empty states.",
  "frontend/src/components/maui/residents/adl/index.ts": "Re-exports ADL dialog and history list components.",
  "frontend/src/components/maui/residents/EditResidentInformationDialog.tsx": "Dialog for editing resident information, managing form state, validation, physician list updates, and saving changes.",
  "frontend/src/components/maui/residents/mar/AddMarRecordDialog.tsx": "Dialog for creating MAR records, validating inputs, and submitting medication administration data.",
  "frontend/src/components/maui/residents/mar/index.ts": "Re-exports MAR dialog and history list components.",
  "frontend/src/components/maui/residents/mar/MarHistoryList.tsx": "Shows a resident’s MAR history with formatted dates, sorting, and record deletion.",
  "frontend/src/components/maui/residents/medications/AddMedicationDialog.tsx": "Dialog for adding a new medication with fields for dosage, route, times, prescriber, and notes.",
  "frontend/src/components/maui/residents/medications/index.ts": "Re-exports the medication creation dialog.",
  "frontend/src/components/maui/residents/ResidentCard.tsx": "Displays resident summary info with actions to view, toggle status, and delete, including a confirmation dialog.",
  "frontend/src/components/maui/residents/ResidentDashboardHeader.tsx": "Header section for the resident dashboard with title and an add-resident button.",
  "frontend/src/components/maui/residents/ResidentFilterSortBar.tsx": "Provides room-based filtering and sorting controls for resident lists.",
  "frontend/src/components/maui/residents/ResidentGrid.tsx": "Renders a grid of ResidentCards or an empty-state message when no residents match filters.",
  "frontend/src/components/maui/residents/ResidentKpiRow.tsx": "Displays KPI cards showing total, active, and discharged resident counts.",
  "frontend/src/components/maui/residents/ResidentStatusTabs.tsx": "Tabs for filtering residents by status: All, Active, or Discharged.",
  "frontend/src/components/maui/residents/vitals/RecordDailyVitalsDialog.tsx": "Dialog for recording daily vitals, validating fields, converting units, and submitting a vitals entry.",
  "frontend/src/components/maui/residents/vitals/VitalsHistoryList.tsx": "Displays a resident's vitals history, supports deletion, sorting, and status indicators for oxygen levels.",
  "frontend/src/components/references/MissingReferencePlaceholder.tsx": "Shows a placeholder card listing missing reference materials and links to a reference checklist.",
  "frontend/src/hooks/residentQueryKeys.ts": "Provides scoped React Query keys for resident-related queries using the user's principal ID.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for login, identity loading, and session state management.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for user profiles, residents, and vitals using the authenticated backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles, light/dark theme variables, and print-specific styling rules.",
  "frontend/src/lib/brand.ts": "Exports static branding data including the facility name and logo path.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging Tailwind and clsx class names.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/maui/Dashboard.tsx": "Dashboard page fetching residents, applying filters/sorting, computing KPIs, and rendering grid and dialogs.",
  "frontend/src/pages/maui/residents/mockResidentMedications.ts": "Provides mock medication data for residents, with a special case for resident ID 3.",
  "frontend/src/pages/maui/residents/mockResidentProfileData.ts": "Defines resident profile and medication types and returns fallback mock profile data.",
  "frontend/src/pages/maui/residents/mockResidents.ts": "Contains mock resident list data used for testing or UI previews.",
  "frontend/src/pages/maui/residents/residentDirectoryViewModel.ts": "Transforms backend resident records into UI view models including age and room formatting.",
  "frontend/src/pages/maui/residents/residentListUtils.ts": "Utility functions for filtering, sorting, KPI calculation, and unique room extraction for resident lists.",
  "frontend/src/pages/maui/residents/ResidentProfile.tsx": "Resident profile page loading backend or mock data, managing vitals/MAR/ADL dialogs, and supporting edits and printing.",
  "frontend/src/pages/maui/residents/ResidentProfilePrintReport.tsx": "Generates a printable resident profile report with demographics, insurance, and medication tables.",
  "frontend/src/pages/references/MoritzReferenceCapture.tsx": "Reference checklist page outlining screenshots and design assets needed for UI recreation.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL and hash query parameters, storing them in sessionStorage, and removing them from the hash without reload.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugins including container queries and animate.",
  "project_state.json": "Defines the current project state, versions, and a list of implemented features with metadata for the Maui Lane Care Home app."
}