{
  "backend/main.mo": "Defines an empty Motoko actor with no functionality.",
  "feature_evidence.json": "Lists two feature evidence reports detailing print functionality requirements and associated frontend files.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for many frontend source files describing their purpose and behavior.",
  "frontend/index.css": "Defines global Tailwind base styles, color tokens, and theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point that loads the React application and references the Maui Lane favicon.",
  "frontend/src/App.tsx": "Sets up routing, query client, auth gate, and renders the main app shell with toaster notifications.",
  "frontend/src/components/auth/ProtectedGate.tsx": "Authentication wrapper that shows a login screen or renders children based on Internet Identity state.",
  "frontend/src/components/maui/MauiAppShell.tsx": "Provides the main app layout with header, navigation, content outlet, and footer with print‑hiding UI chrome.",
  "frontend/src/components/maui/MauiNav.tsx": "Renders the navigation bar with links for Dashboard and Reference Capture and highlights the active route.",
  "frontend/src/components/maui/residents/AddNewResidentDialog.tsx": "Modal form for adding a new resident with extensive personal, medical, and contact information fields.",
  "frontend/src/components/maui/residents/EditResidentInformationDialog.tsx": "Dialog component for editing resident details with validation and dynamic physician fields.",
  "frontend/src/components/maui/residents/ResidentCard.tsx": "Displays a resident summary card with status, metrics, and actions like view, discharge, and delete.",
  "frontend/src/components/maui/residents/ResidentDashboardHeader.tsx": "Header section for the resident dashboard with title and add-resident button.",
  "frontend/src/components/maui/residents/ResidentFilterSortBar.tsx": "Filter and sort bar allowing users to filter residents by room and sort by various fields.",
  "frontend/src/components/maui/residents/ResidentGrid.tsx": "Renders a grid of ResidentCard components or a placeholder when no residents match filters.",
  "frontend/src/components/maui/residents/ResidentKpiRow.tsx": "Shows KPI cards for total, active, and discharged residents.",
  "frontend/src/components/maui/residents/ResidentStatusTabs.tsx": "Tabs for filtering residents by status: All, Active, or Discharged.",
  "frontend/src/components/references/MissingReferencePlaceholder.tsx": "UI placeholder showing missing reference categories and items with a link to the reference checklist.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/clear actions, and manages identity loading and state through an auth client.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future backend-related React Query hooks.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables for light/dark modes, and extensive print-specific styling.",
  "frontend/src/lib/utils.ts": "Provides a utility function combining clsx and tailwind-merge for merging class names.",
  "frontend/src/main.tsx": "Sets up React app root with React Query and Internet Identity providers and loads global CSS.",
  "frontend/src/pages/maui/Dashboard.tsx": "Implements resident dashboard with filters, sorting, KPIs, and add-resident dialog using mock data.",
  "frontend/src/pages/maui/residents/mockResidentMedications.ts": "Provides mock medication data and a helper to fetch medications per resident ID.",
  "frontend/src/pages/maui/residents/mockResidentProfileData.ts": "Builds structured mock profile data for a resident based on mockResidents, including physicians and insurance.",
  "frontend/src/pages/maui/residents/mockResidents.ts": "Supplies mock resident list with IDs, demographics, room info, and counts for physicians and medications.",
  "frontend/src/pages/maui/residents/residentListUtils.ts": "Contains utilities to filter, sort, compute KPIs, and extract unique rooms from resident lists.",
  "frontend/src/pages/maui/residents/ResidentProfile.tsx": "Displays detailed resident profile with tabs, editing, printing, and medication actions using mock data.",
  "frontend/src/pages/maui/residents/ResidentProfilePrintReport.tsx": "Renders a print-only resident profile report with personal, insurance, and medication information.",
  "frontend/src/pages/references/MoritzReferenceCapture.tsx": "React page listing required UI reference screenshots and design details for recreating the Moritz Care Home interface.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and plugins for the project.",
  "project_state.json": "JSON snapshot describing the project's state, goals, and implemented features across backend, frontend, and tooling."
}