{
  "backend/main.mo": "Main Motoko actor defining residents, profiles, and record types with access control, plus CRUD and query logic for the resident directory and related data.",
  "backend/migration.mo": "Migration module converting old actor state to the new structure by initializing a new residents directory and carrying over existing maps.",
  "feature_evidence.json": "Feature evidence report listing implemented frontend tasks, related files, components, and test IDs for residents directory integration.",
  "frontend-file-summaries.txt": "JSON document containing prewritten summaries for various frontend files describing their roles in routing, UI, queries, and styling.",
  "frontend/index.css": "Global Tailwind-based CSS defining OKLCH color tokens, theming variables, dark mode overrides, and base element styling.",
  "frontend/index.html": "Base HTML entry point setting up the root element and loading the main React application script.",
  "frontend/src/App.tsx": "Sets up React Router and React Query, wraps routes in an authentication gate, and defines core application routing including dashboard and resident profile pages.",
  "frontend/src/components/auth/ProtectedGate.tsx": "Authentication gate that initializes identity, shows a sign‑in screen with branding when unauthenticated, and renders children when logged in.",
  "frontend/src/components/maui/MauiAppShell.tsx": "App shell component providing header, navigation, page layout, and sign‑out logic that clears identity and React Query cache.",
  "frontend/src/components/maui/MauiNav.tsx": "Simple navigation bar showing a Dashboard link with active‑state styling based on the current route.",
  "frontend/src/components/maui/residents/AddNewResidentDialog.tsx": "Dialog component for adding a new resident with form validation and mutation to create the resident.",
  "frontend/src/components/maui/residents/adl/AddAdlRecordDialog.tsx": "Dialog for adding an ADL record with required fields, identity validation, and mutation to save the record.",
  "frontend/src/components/maui/residents/adl/AdlHistoryList.tsx": "Displays, sorts, and deletes ADL records for a resident with loading and empty states.",
  "frontend/src/components/maui/residents/adl/index.ts": "Re-exports ADL record dialog and history list components.",
  "frontend/src/components/maui/residents/EditResidentInformationDialog.tsx": "Dialog for editing a resident’s detailed information including physicians, with validation and save handling.",
  "frontend/src/components/maui/residents/mar/AddMarRecordDialog.tsx": "Dialog form for creating a MAR record using selected medication and nurse identity.",
  "frontend/src/components/maui/residents/mar/index.ts": "Re-exports MAR dialog and history list components.",
  "frontend/src/components/maui/residents/mar/MarHistoryList.tsx": "Lists, formats, sorts, and deletes MAR records with loading and empty states.",
  "frontend/src/components/maui/residents/medications/AddMedicationDialog.tsx": "Dialog for adding a medication with dosage, route, times, prescriber, and notes.",
  "frontend/src/components/maui/residents/medications/index.ts": "Re-exports medication dialog component.",
  "frontend/src/components/maui/residents/ResidentCard.tsx": "Displays resident details in a card with options to view profile, toggle status, and delete.",
  "frontend/src/components/maui/residents/ResidentDashboardHeader.tsx": "Header section for the resident dashboard with title and an add-resident button.",
  "frontend/src/components/maui/residents/ResidentFilterSortBar.tsx": "Provides UI controls for filtering residents by room and sorting by various criteria.",
  "frontend/src/components/maui/residents/ResidentGrid.tsx": "Renders a responsive grid of resident cards or a fallback message when empty.",
  "frontend/src/components/maui/residents/ResidentKpiRow.tsx": "Displays KPI cards showing counts of total, active, and discharged residents.",
  "frontend/src/components/maui/residents/ResidentStatusTabs.tsx": "Tabs for filtering residents by status: All, Active, or Discharged.",
  "frontend/src/components/maui/residents/vitals/RecordDailyVitalsDialog.tsx": "Dialog for recording daily vitals, validating fields, and submitting a vitals entry.",
  "frontend/src/components/maui/residents/vitals/VitalsHistoryList.tsx": "Lists and displays resident vitals history with delete support, loading states, and oxygen-level status badges.",
  "frontend/src/components/references/MissingReferencePlaceholder.tsx": "Shows a placeholder card detailing missing reference materials with categorized lists and a link to the full checklist.",
  "frontend/src/hooks/residentQueryKeys.ts": "Provides centralized resident-related React Query keys scoped by principal ID.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor, invalidating dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and state tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, residents, and vitals using the backend actor and principal-scoped keys.",
  "frontend/src/index.css": "Defines Tailwind base styles, light/dark theme variables, and print-specific CSS rules.",
  "frontend/src/lib/brand.ts": "Exports branding constants such as logo path and facility name.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging Tailwind and clsx class names.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, then renders the root component.",
  "frontend/src/pages/maui/Dashboard.tsx": "Main resident dashboard that loads residents, applies filters/sorting, computes KPIs, and displays grid and actions.",
  "frontend/src/pages/maui/residents/mockResidentMedications.ts": "Provides mock medication data for residents, with special cases for specific IDs.",
  "frontend/src/pages/maui/residents/mockResidentProfileData.ts": "Defines resident profile data structures and provides fallback mock profile data.",
  "frontend/src/pages/maui/residents/mockResidents.ts": "Contains a list of mock residents with basic demographic and room info.",
  "frontend/src/pages/maui/residents/residentDirectoryViewModel.ts": "Maps backend resident records to UI view models including age calculation and placeholders.",
  "frontend/src/pages/maui/residents/residentListUtils.ts": "Utility functions for filtering, sorting, KPI calculation, and extracting unique rooms from resident lists.",
  "frontend/src/pages/maui/residents/ResidentProfile.tsx": "Displays a detailed resident profile using backend or mock data with tabs for vitals, MAR, ADL, and medications.",
  "frontend/src/pages/maui/residents/ResidentProfilePrintReport.tsx": "Print‑optimized component rendering resident info and medications in a formatted report layout.",
  "frontend/src/pages/references/MoritzReferenceCapture.tsx": "Page outlining required reference screenshots and design details for recreating the Maui Lane UI.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and remove them from hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, layout, animations, and enabling typography, container query, and animation plugins.",
  "project_state.json": "JSON describing the project's current state, including version, goals, and a list of implemented features with metadata."
}