{
  "backend/main.mo": "Defines an empty Motoko actor with no methods.",
  "feature_evidence.json": "Contains a feature evidence report listing a logo‑replacement feature and associated files and metadata.",
  "frontend-file-summaries.txt": "JSON-formatted text mapping frontend file paths to short descriptive summaries.",
  "frontend/index.css": "Defines global Tailwind base styles and CSS variables for light and dark themes, applying them across the app.",
  "frontend/index.html": "HTML entry point setting up the root container, favicon, and app bootstrap script.",
  "frontend/src/App.tsx": "Main React app wrapper configuring routing, React Query, authentication gating, and global toasts.",
  "frontend/src/components/auth/ProtectedGate.tsx": "Auth gate that shows a login screen using Internet Identity if the user is not authenticated.",
  "frontend/src/components/maui/MauiAppShell.tsx": "Layout shell providing header with user-provided logo, navigation, routed content, and footer.",
  "frontend/src/components/maui/MauiNav.tsx": "Navigation bar rendering a single Dashboard link with active-state styling.",
  "frontend/src/components/maui/residents/AddNewResidentDialog.tsx": "Dialog component with an extensive form for adding a new resident and validating form inputs.",
  "frontend/src/components/maui/residents/EditResidentInformationDialog.tsx": "Dialog for editing resident information with validation and dynamic physician fields.",
  "frontend/src/components/maui/residents/ResidentCard.tsx": "Displays an individual resident card with profile info, actions to view, toggle status, and delete, including a confirmation dialog.",
  "frontend/src/components/maui/residents/ResidentDashboardHeader.tsx": "Renders the header for the resident dashboard with title text and a button to add a new resident.",
  "frontend/src/components/maui/residents/ResidentFilterSortBar.tsx": "Provides dropdown controls for filtering residents by room and sorting by various fields.",
  "frontend/src/components/maui/residents/ResidentGrid.tsx": "Displays a grid of ResidentCard components or a placeholder message when no residents match filters.",
  "frontend/src/components/maui/residents/ResidentKpiRow.tsx": "Shows KPI cards summarizing total, active, and discharged residents.",
  "frontend/src/components/maui/residents/ResidentStatusTabs.tsx": "Renders tabs to filter residents by status: All, Active, or Discharged.",
  "frontend/src/components/references/MissingReferencePlaceholder.tsx": "Displays a placeholder card listing missing reference materials with links and categorized missing items.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identities, and authentication state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future backend-related React Query hooks; contains no active logic.",
  "frontend/src/index.css": "Defines Tailwind base styles plus light/dark themes, custom colors, and print-specific styling.",
  "frontend/src/lib/utils.ts": "Exports a utility to merge Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers before rendering.",
  "frontend/src/pages/maui/Dashboard.tsx": "Dashboard page that manages resident list state, filtering, sorting, KPIs, and renders grid and add-resident dialog.",
  "frontend/src/pages/maui/residents/mockResidentMedications.ts": "Provides mock medication data and a function returning medications by resident ID.",
  "frontend/src/pages/maui/residents/mockResidentProfileData.ts": "Builds detailed mock resident profile data derived from mockResidents and computed DOB.",
  "frontend/src/pages/maui/residents/mockResidents.ts": "Mock resident list with IDs, demographics, rooms, and counts for physicians and medications.",
  "frontend/src/pages/maui/residents/residentListUtils.ts": "Utility functions for filtering, sorting, KPI calculations, and extracting unique rooms for residents.",
  "frontend/src/pages/maui/residents/ResidentProfile.tsx": "Resident profile page that loads detailed mock data, medications, editing, printing, and tabbed sections.",
  "frontend/src/pages/maui/residents/ResidentProfilePrintReport.tsx": "Print-only resident profile report component showing resident info and medication tables.",
  "frontend/src/pages/references/MoritzReferenceCapture.tsx": "Reference checklist page outlining required UI screenshots, design assets, and app structure for replication.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, animations, fonts, and core plugins like typography, container queries, and animate.",
  "project_state.json": "Defines the project state, versioning, and a list of existing features describing backend, frontend, auth, UI components, and app pages."
}