{
  "backend/main.mo": "Defines data types for residents, medications, vitals, ADL, MAR, and related healthcare records within the backend actor.",
  "feature_evidence.json": "Lists feature evidence items mapping features to source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files to aid in build planning and documentation.",
  "frontend/docs/rollback-to-v46.md": "Deployment guide detailing steps, checks, and troubleshooting for rolling back the app to version 46.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining theme variables, dark mode values, and base styling.",
  "frontend/index.html": "HTML entry point setting version metadata, favicon assets, and loading the main frontend bundle.",
  "frontend/public/site.webmanifest": "Web app manifest defining app name, icons, and display properties for installation.",
  "frontend/public/version.txt": "Version marker file containing the value 46.",
  "frontend/src/App.tsx": "Sets up the app's router, query client configuration, and wraps everything in ProtectedGate and QueryClientProvider.",
  "frontend/src/components/auth/ProtectedGate.tsx": "Authentication gate that handles login flow and then wraps content with backend reachability and profile bootstrap gates.",
  "frontend/src/components/brand/BrandLogo.tsx": "Renders the brand logo with multiple fallback URL variants and displays initials if all image loads fail.",
  "frontend/src/components/maui/MauiAppShell.tsx": "Provides the main app layout with header, navigation, content outlet, footer, and sign‑out handling.",
  "frontend/src/components/maui/MauiNav.tsx": "Renders the primary navigation bar with active-route highlighting.",
  "frontend/src/components/maui/residents/AddNewResidentDialog.tsx": "Modal form for creating a new resident, managing nested fields and validation.",
  "frontend/src/components/maui/residents/adl/AddAdlRecordDialog.tsx": "Modal form for creating a new ADL record with fields for date, activity, assistance level, and notes.",
  "frontend/src/components/maui/residents/adl/AdlHistoryList.tsx": "Displays a list of ADL records with sorting, formatting, and deletion capabilities.",
  "frontend/src/components/maui/residents/adl/index.ts": "Re-exports the ADL dialog and history list components.",
  "frontend/src/components/maui/residents/EditResidentInformationDialog.tsx": "Dialog for editing resident information with dynamic physician and responsible-person lists.",
  "frontend/src/components/maui/residents/mar/AddMarRecordDialog.tsx": "Modal form for adding a MAR record by selecting an active medication and recording administration details.",
  "frontend/src/components/maui/residents/mar/index.ts": "Re-exports the MAR dialog and history list components.",
  "frontend/src/components/maui/residents/mar/MarHistoryList.tsx": "Displays sorted MAR history entries with date/time formatting and delete support.",
  "frontend/src/components/maui/residents/medications/AddMedicationDialog.tsx": "Dialog for adding a new medication with fields for name, dosage, route, times, prescriber, and notes.",
  "frontend/src/components/maui/residents/medications/EditMedicationDialog.tsx": "Dialog component for editing a medication, handling form state, validation, and saving updated medication data.",
  "frontend/src/components/maui/residents/medications/index.ts": "Re-exports medication-related components for easier module imports.",
  "frontend/src/components/maui/residents/medications/MedicationCard.tsx": "Displays a medication’s details with status, route, times, physician, and action buttons.",
  "frontend/src/components/maui/residents/medications/MedicationPhysicianSelect.tsx": "Physician selection input supporting unassigned and specialty display, with fallback UI when no physicians exist.",
  "frontend/src/components/maui/residents/medications/MedicationRouteSelect.tsx": "Select input for medication administration route, including support for custom 'other' routes.",
  "frontend/src/components/maui/residents/medications/MedicationRowActions.tsx": "Row action controls for editing, discontinuing, resuming, and deleting medications with confirmation dialogs.",
  "frontend/src/components/maui/residents/medications/MedicationsTab.tsx": "Renders a list of medications and provides an interface to add, edit, or manage their status.",
  "frontend/src/components/maui/residents/ResidentCard.tsx": "Shows a resident summary card with actions to view, delete, or toggle status.",
  "frontend/src/components/maui/residents/ResidentDashboardHeader.tsx": "Header section for the residents dashboard with an add-resident button.",
  "frontend/src/components/maui/residents/ResidentFilterSortBar.tsx": "Provides room-based filtering and sorting controls for the resident list.",
  "frontend/src/components/maui/residents/ResidentGrid.tsx": "Displays residents in a responsive grid or shows an empty-state message.",
  "frontend/src/components/maui/residents/ResidentKpiRow.tsx": "Shows KPI cards for total, active, and discharged residents.",
  "frontend/src/components/maui/residents/ResidentStatusTabs.tsx": "Provides a tab UI for filtering residents by All, Active, or Discharged status.",
  "frontend/src/components/maui/residents/vitals/RecordDailyVitalsDialog.tsx": "Dialog for recording daily vitals with form inputs, validation, temperature conversion, and submission logic.",
  "frontend/src/components/maui/residents/vitals/VitalsHistoryList.tsx": "Displays and manages a resident’s vitals history, including sorting, formatting, and deleting entries with status indicators.",
  "frontend/src/components/references/MissingReferencePlaceholder.tsx": "Shows a placeholder card listing missing reference materials and links to the full checklist.",
  "frontend/src/components/startup/BackendReachabilityGate.tsx": "Gates app rendering until the backend is confirmed reachable, showing loading or error states with retry.",
  "frontend/src/components/startup/ProfileBootstrapGate.tsx": "Ensures the user profile is loaded or created before rendering children, handling loading and failure states.",
  "frontend/src/hooks/residentQueryKeys.ts": "Provides centralized factory functions for resident-related React Query keys scoped by principal.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useActorReady.ts": "Reports when the backend actor and identity are fully initialized and ready for dependent queries.",
  "frontend/src/hooks/useHealthCheck.ts": "Performs a timed backend health check using an anonymous actor and exposes reachability status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login flow, and provides identity context to the app.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profiles, residents directory with fallbacks, and mutations for CRUD operations using an actor backend.",
  "frontend/src/index.css": "Defines Tailwind layers, light/dark theme CSS variables, and print-specific styling rules.",
  "frontend/src/lib/brand.ts": "Exports branding constants including app name and logo path.",
  "frontend/src/lib/medicationRoutes.ts": "Defines medication route options and utilities to convert between UI values, backend types, and display labels.",
  "frontend/src/lib/medications.ts": "Utility functions for updating, deleting, filtering, and generating IDs for medication records.",
  "frontend/src/lib/utils.ts": "Exports a helper for merging class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers and loads global styles.",
  "frontend/src/pages/maui/Dashboard.tsx": "Implements the residents dashboard with filters, sorting, KPIs, health checks, and directory interactions.",
  "frontend/src/pages/maui/residents/mockResidentMedications.ts": "Defines a Medication type and provides mock medication lists based on resident ID.",
  "frontend/src/pages/maui/residents/mockResidentProfileData.ts": "Defines resident profile data structures and returns fallback mock profile data.",
  "frontend/src/pages/maui/residents/mockResidents.ts": "Provides a mock list of residents with basic info like age, room, and medication counts.",
  "frontend/src/pages/maui/residents/residentAge.ts": "Utility functions to calculate and format a resident's age from a birthdate.",
  "frontend/src/pages/maui/residents/residentDirectoryViewModel.ts": "Transforms backend resident data into simplified view models with formatted age and room display.",
  "frontend/src/pages/maui/residents/residentListUtils.ts": "Functions for filtering, sorting, and computing KPIs on resident view models.",
  "frontend/src/pages/maui/residents/ResidentProfile.tsx": "Renders a resident profile view with tabs, backend data loading, medication management, vitals, MAR, ADL dialogs, and print options.",
  "frontend/src/pages/maui/residents/ResidentProfilePrintReport.tsx": "React component that renders a printable resident profile report including demographics, insurance, and medications.",
  "frontend/src/pages/references/MoritzReferenceCapture.tsx": "UI page outlining required reference materials and screenshots for recreating the app design.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and persisting URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, animations, and typography/container-query/animate plugins.",
  "project_state.json": "Defines project metadata and documents backend initialization race issues along with related existing feature requirements."
}