{
  "backend/main.mo": "Defines the actor’s data models for residents, medications, vitals, MAR, ADL records, and related entities.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides short human-written summaries for numerous frontend source files and components.",
  "frontend/docs/deploy-v57.md": "Historical deployment guide for Version 57 with verification steps, deployment commands, and smoke‑test checklist.",
  "frontend/docs/deploy-v58.md": "Historical deployment guide for Version 58 including version checks, deployment steps, and full post-deploy tests.",
  "frontend/docs/deploy-v59.md": "Primary deployment guide for Version 59 covering version markers, build/deploy steps, smoke tests, and troubleshooting.",
  "frontend/docs/rollback-to-v46.md": "Checklist for deploying and validating the rollback build to version 57, including pre‑deployment checks, deployment commands, smoke tests, and troubleshooting.",
  "frontend/index.css": "Defines Tailwind base layers and CSS variables for light and dark themes, along with global border and background/text styles.",
  "frontend/index.html": "HTML entry point setting app version 59 and loading the main React bundle and icons.",
  "frontend/public/site.webmanifest": "PWA manifest defining app name, icon, colors, and standalone display mode.",
  "frontend/public/version.txt": "Contains the current frontend version marker, set to 59.",
  "frontend/scripts/deploy-ic-v59.sh": "Shell script automating version 59 deployment with version checks, dfx validation, and post‑deploy verification reminders.",
  "frontend/scripts/README.md": "Overview of deployment scripts and prerequisites for deploying version 59.",
  "frontend/src/App.tsx": "Sets up the app’s router and query client, wrapping routes with authentication and global UI providers.",
  "frontend/src/components/auth/ProtectedGate.tsx": "Authentication gate that shows loading, login UI, or protected content based on Internet Identity state.",
  "frontend/src/components/brand/BrandLogo.tsx": "Logo component that tries multiple URL variants and falls back to initials if image loading fails.",
  "frontend/src/components/maui/MauiAppShell.tsx": "App shell providing header, navigation, main content outlet, footer, and sign‑out handling.",
  "frontend/src/components/maui/MauiNav.tsx": "Navigation bar rendering the dashboard link with active‑state styling.",
  "frontend/src/components/maui/residents/AddNewResidentDialog.tsx": "A dialog component for creating a new resident with extensive form state, validation, and nested data handling.",
  "frontend/src/components/maui/residents/adl/AddAdlRecordDialog.tsx": "A dialog for adding a new ADL record with validation, identity checks, and API submission.",
  "frontend/src/components/maui/residents/adl/AdlHistoryList.tsx": "Displays a resident's ADL history with loading, empty state, sorting, and delete functionality.",
  "frontend/src/components/maui/residents/adl/index.ts": "Re-exports ADL-related components for easier imports.",
  "frontend/src/components/maui/residents/EditResidentInformationDialog.tsx": "A dialog for editing an existing resident’s information with form state resets, field handlers, and add/remove actions.",
  "frontend/src/components/maui/residents/mar/AddMarRecordDialog.tsx": "Dialog for creating a new MAR record, handling medication selection, validation, and submission.",
  "frontend/src/components/maui/residents/mar/index.ts": "Re-exports MAR-related components for easier imports.",
  "frontend/src/components/maui/residents/mar/MarHistoryList.tsx": "Displays a resident's MAR history with sorting, empty/loading states, and delete actions.",
  "frontend/src/components/maui/residents/medications/AddMedicationDialog.tsx": "Dialog for adding a new medication, including route selection, times, physician, and notes.",
  "frontend/src/components/maui/residents/medications/EditMedicationDialog.tsx": "Dialog for editing an existing medication, preloading fields and saving updates.",
  "frontend/src/components/maui/residents/medications/index.ts": "Re-exports medication-related components and selectors for easier imports.",
  "frontend/src/components/maui/residents/medications/MedicationPhysicianSelect.tsx": "Select component for choosing a prescribing physician with fallback text input when none exist.",
  "frontend/src/components/maui/residents/medications/MedicationRouteSelect.tsx": "Component for selecting a medication administration route, including an 'other' option with a text input.",
  "frontend/src/components/maui/residents/medications/MedicationRowActions.tsx": "Renders edit, discontinue/resume, and delete action buttons for a medication with confirmation dialogs.",
  "frontend/src/components/maui/residents/ResidentCard.tsx": "Displays a resident summary card with status, actions, and delete confirmation dialog.",
  "frontend/src/components/maui/residents/ResidentDashboardHeader.tsx": "Header section for the resident dashboard with a title and button to add new residents.",
  "frontend/src/components/maui/residents/ResidentFilterSortBar.tsx": "UI bar for filtering residents by room and sorting by different fields.",
  "frontend/src/components/maui/residents/ResidentGrid.tsx": "Renders a grid of resident cards or a placeholder when no residents match filters.",
  "frontend/src/components/maui/residents/ResidentKpiRow.tsx": "Shows KPI counts for total, active, and discharged residents in three cards.",
  "frontend/src/components/maui/residents/ResidentStatusTabs.tsx": "Tab selector for filtering residents by status: All, Active, or Discharged.",
  "frontend/src/components/maui/residents/vitals/RecordDailyVitalsDialog.tsx": "Dialog for entering daily vitals, validating inputs, and submitting a new vitals record.",
  "frontend/src/components/maui/residents/vitals/VitalsHistoryList.tsx": "Displays a resident's vitals history with sorting, status badges, and delete support.",
  "frontend/src/components/references/MissingReferencePlaceholder.tsx": "Shows a placeholder card listing missing reference materials with a link to the full checklist.",
  "frontend/src/hooks/residentQueryKeys.ts": "Provides centralized factory functions for resident-related React Query keys.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor while invalidating dependent queries on change.",
  "frontend/src/hooks/useHealthCheck.ts": "Runs a timeout‑protected anonymous health check and reports reachability status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles and resident directory data, with fallbacks and identity-aware caching.",
  "frontend/src/index.css": "Global Tailwind CSS setup including light/dark theme variables and custom print styles for reports.",
  "frontend/src/lib/brand.ts": "Exports application branding constants such as name and logo path.",
  "frontend/src/lib/medicationRoutes.ts": "Defines medication administration routes and utilities for converting, formatting, and mapping route values between UI and backend.",
  "frontend/src/lib/medications.ts": "Provides helper functions for updating, deleting, toggling, filtering, and generating IDs for medication records.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with InternetIdentityProvider and React Query's QueryClientProvider.",
  "frontend/src/pages/maui/Dashboard.tsx": "Implements the main residents dashboard with filtering, sorting, KPIs, and actions using data from backend queries.",
  "frontend/src/pages/maui/residents/mockResidentMedications.ts": "Provides mock medication data for residents, including a special case for resident ID 3.",
  "frontend/src/pages/maui/residents/mockResidentProfileData.ts": "Defines resident profile data types and returns fallback mock profile data when backend data is unavailable.",
  "frontend/src/pages/maui/residents/mockResidents.ts": "Contains a mock list of residents with basic demographic and status information.",
  "frontend/src/pages/maui/residents/residentAge.ts": "Utility functions to calculate and format a resident's age from a birthdate string.",
  "frontend/src/pages/maui/residents/residentDirectoryViewModel.ts": "Transforms backend resident data into UI-friendly view models including age and room formatting.",
  "frontend/src/pages/maui/residents/residentListUtils.ts": "Utility functions for filtering, sorting, and computing KPIs for resident lists.",
  "frontend/src/pages/maui/residents/ResidentProfile.tsx": "Main resident profile page that loads backend or mock data and manages dialogs for vitals, MAR, ADL, medications, editing, and printing.",
  "frontend/src/pages/maui/residents/ResidentProfilePrintReport.tsx": "Generates a printable resident profile report including demographics, insurance, and medication details.",
  "frontend/src/pages/references/MoritzReferenceCapture.tsx": "Displays a checklist-style reference capture guide outlining required screenshots and design details.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), store/retrieve them in sessionStorage, and persist or clear parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and container settings, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing architecture, Maui Lane app build notes, existing features, known issues, and generated assets for the ICP Motoko + React project."
}