{
  "backend/main.mo": "Empty Motoko actor with no methods or state.",
  "feature_evidence.json": "Feature evidence report listing two features that update the header logo and favicon, including affected files and metadata.",
  "frontend-file-summaries.txt": "JSON-formatted list of short summaries for major frontend components, pages, utilities, and configuration files.",
  "frontend/index.css": "Defines global Tailwind layers and OKLCH color tokens for light/dark themes, plus base style resets.",
  "frontend/index.html": "HTML entry point setting page metadata and referencing the updated v2 app icon and main script.",
  "frontend/src/App.tsx": "Root React app wiring TanStack Router, React Query, authentication gate, and global toaster.",
  "frontend/src/components/auth/ProtectedGate.tsx": "Authentication wrapper that shows a login screen or loading state before rendering protected content.",
  "frontend/src/components/maui/MauiAppShell.tsx": "Main layout shell with header (updated logo), navigation, routed content outlet, and footer.",
  "frontend/src/components/maui/MauiNav.tsx": "Simple navigation bar showing only the Dashboard tab with active-route styling.",
  "frontend/src/components/maui/residents/AddNewResidentDialog.tsx": "Large modal form for creating a new resident, handling dynamic lists and validation before submitting a resident summary.",
  "frontend/src/components/maui/residents/EditResidentInformationDialog.tsx": "Modal for editing resident details with form state, validation, physician list management, and save handling.",
  "frontend/src/components/maui/residents/ResidentCard.tsx": "Displays resident details in a card with actions for viewing profile, discharging, and deleting.",
  "frontend/src/components/maui/residents/ResidentDashboardHeader.tsx": "Renders the header for the resident dashboard with a title and add‑resident button.",
  "frontend/src/components/maui/residents/ResidentFilterSortBar.tsx": "Provides UI controls for filtering residents by room and sorting by various fields.",
  "frontend/src/components/maui/residents/ResidentGrid.tsx": "Shows a grid of ResidentCard components or a fallback message if none match filters.",
  "frontend/src/components/maui/residents/ResidentKpiRow.tsx": "Displays KPI cards summarizing total, active, and discharged residents.",
  "frontend/src/components/maui/residents/ResidentStatusTabs.tsx": "Renders tabs to filter residents by status: All, Active, or Discharged.",
  "frontend/src/components/references/MissingReferencePlaceholder.tsx": "Shows a placeholder card listing missing reference materials and links to a checklist.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication and login state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future backend‑related React Query hooks.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom light/dark theme variables plus print‑specific CSS.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging Tailwind class names.",
  "frontend/src/main.tsx": "Initializes the app root, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/maui/Dashboard.tsx": "Dashboard page that displays resident KPIs, filtering/sorting controls, resident grid, and an add-resident dialog using mock data.",
  "frontend/src/pages/maui/residents/mockResidentMedications.ts": "Provides mock medication data and a helper to fetch medications for a resident by ID.",
  "frontend/src/pages/maui/residents/mockResidentProfileData.ts": "Generates mock resident profile data from basic resident info, including parsed room/bed and contact details.",
  "frontend/src/pages/maui/residents/mockResidents.ts": "Mock resident list with basic attributes like room, age, status, physicians, and medication counts.",
  "frontend/src/pages/maui/residents/residentListUtils.ts": "Utility functions for filtering, sorting, KPI computation, and extracting unique rooms from resident data.",
  "frontend/src/pages/maui/residents/ResidentProfile.tsx": "Resident profile page showing detailed info, medications, editing, and print options using mock profile data and router params.",
  "frontend/src/pages/maui/residents/ResidentProfilePrintReport.tsx": "Print-only component that renders resident profile and medication data into a structured printable report.",
  "frontend/src/pages/references/MoritzReferenceCapture.tsx": "UI page listing required reference materials and screenshots needed to recreate the Maui Lane Care Home interface.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining dark mode, content paths, extended theme colors, fonts, animations, and plugins.",
  "project_state.json": "Project metadata file describing the current build state, features, and versions for the Maui Lane Care Home application."
}