{
  "backend/main.mo": "Defines the backend actor including resident, medication, vitals, MAR, and ADL data types and related DTOs.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to modified files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend source files for reference.",
  "frontend/docs/deploy-v57.md": "Deployment guide for Version 57 detailing verification steps, deployment commands, and smoke‑test checklist.",
  "frontend/docs/deploy-v58.md": "Deployment guide for Version 58 with updated version markers, deployment steps, and post-deploy tests.",
  "frontend/docs/rollback-to-v46.md": "Rollback guide restoring Version 57 behavior with steps, validation checks, and troubleshooting notes.",
  "frontend/index.css": "Defines global Tailwind CSS variables and themes for light and dark modes with palette and layout tokens.",
  "frontend/index.html": "HTML entry point loading the React app and linking icons and manifest.",
  "frontend/public/site.webmanifest": "PWA manifest defining app name, icon, and display theme.",
  "frontend/public/version.txt": "Contains the app version number 58.",
  "frontend/src/App.tsx": "Sets up React Router and QueryClient, wraps routes in authentication gate and app shell.",
  "frontend/src/components/auth/ProtectedGate.tsx": "Handles Internet Identity auth flow, showing loading, login prompt, or protected content.",
  "frontend/src/components/brand/BrandLogo.tsx": "Displays the brand logo with fallback logic for missing images and multiple URL variants.",
  "frontend/src/components/maui/MauiAppShell.tsx": "App shell with header, navigation, footer, and sign-out handling.",
  "frontend/src/components/maui/MauiNav.tsx": "Navigation bar rendering dashboard link with active-state styling.",
  "frontend/src/components/maui/residents/AddNewResidentDialog.tsx": "Dialog for creating a new resident with form fields, validation, and submission via mutation.",
  "frontend/src/components/maui/residents/adl/AddAdlRecordDialog.tsx": "Dialog form for creating new ADL records with validation and submission logic.",
  "frontend/src/components/maui/residents/adl/AdlHistoryList.tsx": "Lists, sorts, and deletes ADL records, displaying loading and empty states.",
  "frontend/src/components/maui/residents/adl/index.ts": "Re-exports ADL dialog and history list components.",
  "frontend/src/components/maui/residents/EditResidentInformationDialog.tsx": "Dialog for editing resident information with dynamic lists for physicians and contacts.",
  "frontend/src/components/maui/residents/mar/AddMarRecordDialog.tsx": "Dialog form for creating MAR records tied to active medications.",
  "frontend/src/components/maui/residents/mar/index.ts": "Re-exports MAR dialog and history list components.",
  "frontend/src/components/maui/residents/mar/MarHistoryList.tsx": "Displays, sorts, and deletes MAR records with fallback UI states.",
  "frontend/src/components/maui/residents/medications/AddMedicationDialog.tsx": "Modal form for adding a medication, handling input fields, route/physician selection, time entries, and submission formatting.",
  "frontend/src/components/maui/residents/medications/EditMedicationDialog.tsx": "Modal for editing an existing medication, populating fields from the record and saving updates with formatted values.",
  "frontend/src/components/maui/residents/medications/index.ts": "Barrel file exporting medication-related components and utilities.",
  "frontend/src/components/maui/residents/medications/MedicationPhysicianSelect.tsx": "Physician selector component with fallback text input when no physicians exist, supporting unassigned values.",
  "frontend/src/components/maui/residents/medications/MedicationRouteSelect.tsx": "Selector for medication administration route with support for predefined options and a custom 'other' text field.",
  "frontend/src/components/maui/residents/medications/MedicationRowActions.tsx": "Row action controls for medications including edit, discontinue/resume, and delete with confirmation dialogs.",
  "frontend/src/components/maui/residents/ResidentCard.tsx": "Card displaying resident summary with view, status toggle, and delete actions.",
  "frontend/src/components/maui/residents/ResidentDashboardHeader.tsx": "Header component displaying page title and an action button to add a resident.",
  "frontend/src/components/maui/residents/ResidentFilterSortBar.tsx": "Provides room filtering and sorting controls for the resident list.",
  "frontend/src/components/maui/residents/ResidentGrid.tsx": "Renders a grid of ResidentCard components or an empty state when no residents match.",
  "frontend/src/components/maui/residents/ResidentKpiRow.tsx": "Shows KPI cards for total, active, and discharged residents.",
  "frontend/src/components/maui/residents/ResidentStatusTabs.tsx": "Status filter tabs for switching between all, active, and discharged residents.",
  "frontend/src/components/maui/residents/vitals/RecordDailyVitalsDialog.tsx": "Dialog for entering and submitting daily vital signs with validation, timestamp creation, and form reset.",
  "frontend/src/components/maui/residents/vitals/VitalsHistoryList.tsx": "Displays a resident's vitals history with sorting, status badges, and delete actions using query hooks.",
  "frontend/src/components/references/MissingReferencePlaceholder.tsx": "Renders a placeholder card listing missing reference items and links to a full checklist.",
  "frontend/src/hooks/residentQueryKeys.ts": "Provides scoped React Query keys for resident directory and detail lookups.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useHealthCheck.ts": "Runs a timeout‑protected health check against the backend and returns a derived reachability status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login flow, and persistent identity loading.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for user profiles, residents directory, and other resident‑related operations using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom light/dark themes plus print‑specific styling.",
  "frontend/src/lib/brand.ts": "Exports app branding constants including name and logo path.",
  "frontend/src/lib/medicationRoutes.ts": "Defines medication route options and utilities to convert between backend route objects, UI select values, and display labels.",
  "frontend/src/lib/medications.ts": "Provides helpers to update, delete, filter, toggle status, and generate IDs for medication objects in arrays.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with query and identity providers before rendering.",
  "frontend/src/pages/maui/Dashboard.tsx": "Implements the resident dashboard with filtering, sorting, KPIs, health checks, and resident management actions.",
  "frontend/src/pages/maui/residents/mockResidentMedications.ts": "Provides mock medication data for residents with a sample generator function.",
  "frontend/src/pages/maui/residents/mockResidentProfileData.ts": "Defines mock resident profile structures and a fallback profile generator.",
  "frontend/src/pages/maui/residents/mockResidents.ts": "Contains a mock resident directory with basic demographic and care info.",
  "frontend/src/pages/maui/residents/residentAge.ts": "Provides utilities to calculate a resident’s age from a birthdate and format it for display.",
  "frontend/src/pages/maui/residents/residentDirectoryViewModel.ts": "Defines ResidentViewModel and utilities to map backend resident data into UI-friendly objects with age and room formatting.",
  "frontend/src/pages/maui/residents/residentListUtils.ts": "Provides filtering, sorting, KPI calculations, and room extraction helpers for ResidentViewModel lists.",
  "frontend/src/pages/maui/residents/ResidentProfile.tsx": "Displays and manages a resident’s full profile, including vitals, medications, ADLs, and editable personal information.",
  "frontend/src/pages/maui/residents/ResidentProfilePrintReport.tsx": "Renders a printable resident profile report including demographics and medication details.",
  "frontend/src/pages/references/MoritzReferenceCapture.tsx": "Renders a reference‑capture page listing required screenshots and design details for replicating the Moritz UI.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session‑persisted parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and plugins for the project.",
  "project_state.json": "Project metadata describing architecture, features, issues, and generated assets for the Maui Lane Care Home build."
}