{
  "backend/main.mo": "Motoko canister managing user profiles and resident vitals with access control, allowing users to create, view, and delete their own vitals records.",
  "feature_evidence.json": "Feature evidence report listing frontend files, components, and test IDs required for implementing daily vitals UI and backend wiring.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend components, utilities, pages, and hooks used in the project.",
  "frontend/index.css": "Global Tailwind-based CSS defining color tokens, dark mode values, and base layout styles for the Maui Lane design system.",
  "frontend/index.html": "HTML entry point that loads the React application and sets the favicon and title for Maui Lane Care Home.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router, React Query, authentication gating, and global toasts.",
  "frontend/src/components/auth/ProtectedGate.tsx": "Authentication wrapper that initializes Internet Identity and shows a login screen or protected content depending on auth state.",
  "frontend/src/components/maui/MauiAppShell.tsx": "Main app shell providing header, nav, footer, and sign‑out support with automatic logo fallback handling.",
  "frontend/src/components/maui/MauiNav.tsx": "Navigation bar showing the Dashboard link with active state styling using TanStack Router.",
  "frontend/src/components/maui/residents/AddNewResidentDialog.tsx": "Provides a dialog with extensive form inputs to add a new resident, managing nested physician, responsible person, and medication data with validation.",
  "frontend/src/components/maui/residents/EditResidentInformationDialog.tsx": "Dialog for editing an existing resident’s information with validation and support for modifying physician entries.",
  "frontend/src/components/maui/residents/ResidentCard.tsx": "Displays a resident’s summary card with actions to view, delete, or toggle resident status and shows basic stats.",
  "frontend/src/components/maui/residents/ResidentDashboardHeader.tsx": "Header section for the resident dashboard with a title and button to add a new resident.",
  "frontend/src/components/maui/residents/ResidentFilterSortBar.tsx": "Provides dropdown controls to filter residents by room and sort by room, name, or age.",
  "frontend/src/components/maui/residents/ResidentGrid.tsx": "Renders a grid of ResidentCard components or an empty state when no residents match filters.",
  "frontend/src/components/maui/residents/ResidentKpiRow.tsx": "Shows KPI cards summarizing total, active, and discharged residents.",
  "frontend/src/components/maui/residents/ResidentStatusTabs.tsx": "Tab controls for filtering residents by All, Active, or Discharged status.",
  "frontend/src/components/maui/residents/vitals/RecordDailyVitalsDialog.tsx": "Dialog for entering and submitting daily vitals with validation and API submission via a query hook.",
  "frontend/src/components/maui/residents/vitals/VitalsHistoryList.tsx": "Displays a list of vitals records with sorting, formatting, oxygen status indicators, and delete support via mutation.",
  "frontend/src/components/references/MissingReferencePlaceholder.tsx": "Renders a placeholder card listing missing reference items and linking to a checklist page.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, state management, and context for authentication across the app.",
  "frontend/src/hooks/useQueries.ts": "Defines vitals-related React Query hooks for listing, creating, and deleting vitals via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom theme variables for light/dark mode, and print-specific styling.",
  "frontend/src/lib/utils.ts": "Provides a utility function to merge Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/maui/Dashboard.tsx": "Implements the main residents dashboard with filtering, sorting, KPIs, and add/delete/toggle resident actions.",
  "frontend/src/pages/maui/residents/mockResidentMedications.ts": "Provides mock medication data and a helper to return medications for a given resident ID.",
  "frontend/src/pages/maui/residents/mockResidentProfileData.ts": "Builds mock resident profile data from basic resident info, including derived fields like room, bed, and date of birth.",
  "frontend/src/pages/maui/residents/mockResidents.ts": "Contains a list of mock residents with IDs, names, ages, rooms, and status used throughout the app.",
  "frontend/src/pages/maui/residents/residentListUtils.ts": "Utility functions for filtering, sorting, and computing KPIs for resident lists, plus extracting unique room names.",
  "frontend/src/pages/maui/residents/ResidentProfile.tsx": "Resident profile page that loads resident data, medications, and vitals, provides editing and printing dialogs, and handles UI actions.",
  "frontend/src/pages/maui/residents/ResidentProfilePrintReport.tsx": "Generates a print‑friendly resident profile report including personal info, insurance details, and medication lists.",
  "frontend/src/pages/references/MoritzReferenceCapture.tsx": "Renders a reference‑capture checklist page outlining required screenshots and design details for recreating the UI.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters, including sessionStorage integration and hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, typography, container queries, animations, and extended theme settings.",
  "project_state.json": "JSON metadata describing the project's current state, including schema version and a detailed list of implemented features and components."
}