{
  "backend/main.mo": "Actor exposes user profile and resident health record CRUD with admin/user authorization using AccessControl and Map/List storage.",
  "feature_evidence.json": "Feature evidence linking specific UI changes—logo removal and favicon removal—to affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing their structure, behavior, and UI roles.",
  "frontend/index.css": "Defines global Tailwind-based design tokens and light/dark theme variables plus base background and text styling.",
  "frontend/index.html": "HTML entrypoint setting the app title and loading the main frontend script without a favicon.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with authentication and React Query providers.",
  "frontend/src/components/auth/ProtectedGate.tsx": "Gate component that checks Internet Identity state and displays a login card or protected content.",
  "frontend/src/components/maui/MauiAppShell.tsx": "Layout shell providing header, navigation, routed content, and footer with sign-out control.",
  "frontend/src/components/maui/MauiNav.tsx": "Simplified navigation bar showing a single Dashboard link with active-state styling.",
  "frontend/src/components/maui/residents/AddNewResidentDialog.tsx": "Dialog form for creating new residents with multi-section data entry and validation handling.",
  "frontend/src/components/maui/residents/adl/AddAdlRecordDialog.tsx": "Dialog for adding an ADL record with form validation and backend submission.",
  "frontend/src/components/maui/residents/adl/AdlHistoryList.tsx": "Displays sorted ADL records with delete support and loading/empty states.",
  "frontend/src/components/maui/residents/adl/index.ts": "Re-exports ADL dialog and history list components.",
  "frontend/src/components/maui/residents/EditResidentInformationDialog.tsx": "Modal form for editing resident details with validation, physician list management, and save handling.",
  "frontend/src/components/maui/residents/mar/AddMarRecordDialog.tsx": "Dialog component for creating a MAR record, handling form input, validation, and submitting records via createMarRecord.",
  "frontend/src/components/maui/residents/mar/index.ts": "Re-exports MAR-related components for easier imports.",
  "frontend/src/components/maui/residents/mar/MarHistoryList.tsx": "Displays a sortable list of MAR records with delete functionality and loading/empty states.",
  "frontend/src/components/maui/residents/ResidentCard.tsx": "Displays a resident summary card with profile navigation, status toggle, and delete confirmation.",
  "frontend/src/components/maui/residents/ResidentDashboardHeader.tsx": "Header for the resident dashboard with title and an add-resident button.",
  "frontend/src/components/maui/residents/ResidentFilterSortBar.tsx": "Provides room filter and sorting controls for the resident list.",
  "frontend/src/components/maui/residents/ResidentGrid.tsx": "Renders a grid of ResidentCard components or an empty state when no residents match filters.",
  "frontend/src/components/maui/residents/ResidentKpiRow.tsx": "Shows KPI cards for total, active, and discharged residents.",
  "frontend/src/components/maui/residents/ResidentStatusTabs.tsx": "Renders tabs for filtering residents by status: All, Active, or Discharged.",
  "frontend/src/components/maui/residents/vitals/RecordDailyVitalsDialog.tsx": "Dialog for recording daily vitals, including form handling, unit conversion, validation, and submission to createVitals.",
  "frontend/src/components/maui/residents/vitals/VitalsHistoryList.tsx": "Shows a sortable vitals history list with oxygen status badges and deletion support, plus loading/empty states.",
  "frontend/src/components/references/MissingReferencePlaceholder.tsx": "Placeholder component indicating missing reference materials, listing required items and linking to the reference checklist.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, logging in, and clearing identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for listing, creating, and deleting vitals, MAR, and ADL records using an actor and authenticated identity.",
  "frontend/src/index.css": "Configures Tailwind styles, theme variables, dark mode settings, and detailed print styles for reports.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app by setting up QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/maui/Dashboard.tsx": "Implements the residents dashboard with filtering, sorting, KPIs, and a dialog for adding residents using mock data.",
  "frontend/src/pages/maui/residents/mockResidentMedications.ts": "Defines a Medication interface and returns mock medication lists, with a special set for resident ID 3.",
  "frontend/src/pages/maui/residents/mockResidentProfileData.ts": "Builds mock resident profile details using mockResidents, parsing room info and generating birth dates.",
  "frontend/src/pages/maui/residents/mockResidents.ts": "Provides a static list of mock resident records including demographics, room info, and counts for physicians and medications.",
  "frontend/src/pages/maui/residents/residentListUtils.ts": "Utility functions for filtering, sorting, and extracting KPIs and unique rooms from resident data.",
  "frontend/src/pages/maui/residents/ResidentProfile.tsx": "Displays a resident profile with tabs, vitals, MAR, ADL data, editing dialogs, and print/report functionality.",
  "frontend/src/pages/maui/residents/ResidentProfilePrintReport.tsx": "Renders a print‑optimized resident profile report including personal info, insurance, and medication sections.",
  "frontend/src/pages/references/MoritzReferenceCapture.tsx": "React page rendering categorized lists of required reference materials for UI replication tasks.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters for routing state.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and enabling plugins for typography, queries, and animations.",
  "project_state.json": "JSON snapshot describing project version, goals, and existing implemented features with metadata."
}