{
  "backend/main.mo": "Defines the main backend actor with types for residents, medications, vitals, MAR, ADL, and related entities, forming the core data model for the system.",
  "backend/migration.mo": "Provides migration logic converting old resident and medication records to the new schema including medication routes.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature requests to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing purpose and behavior of various frontend files across the app.",
  "frontend/docs/rollback-to-v46.md": "Deployment guide detailing steps and checks for rolling back the application to version 46.",
  "frontend/index.css": "Defines global Tailwind CSS variables and light/dark theme styles for the frontend.",
  "frontend/index.html": "Frontend HTML entry point setting metadata, version tag 46, icons, and mounting the React app.",
  "frontend/public/site.webmanifest": "Web app manifest defining app name, icons, colors, and display mode.",
  "frontend/public/version.txt": "Contains the current deployed frontend version number, 46.",
  "frontend/src/App.tsx": "Configures routing, React Query, authentication gate, and the main app shell for the frontend.",
  "frontend/src/components/auth/ProtectedGate.tsx": "Wrapper that shows initialization/login UI using Internet Identity and renders children when authenticated.",
  "frontend/src/components/brand/BrandLogo.tsx": "Displays a logo image with multiple URL fallbacks and an initials fallback if all variants fail.",
  "frontend/src/components/maui/MauiAppShell.tsx": "Main app shell with header, navigation, sign‑out handling, routed content, and footer.",
  "frontend/src/components/maui/MauiNav.tsx": "Simple navigation bar highlighting the active route, currently containing a dashboard link.",
  "frontend/src/components/maui/residents/AddNewResidentDialog.tsx": "Dialog for creating a new resident with extensive form fields, validation handling, and mutation submission.",
  "frontend/src/components/maui/residents/adl/AddAdlRecordDialog.tsx": "Dialog form for creating ADL records with validation and submission to backend.",
  "frontend/src/components/maui/residents/adl/AdlHistoryList.tsx": "Lists, sorts, and allows deletion of ADL records for a resident, with loading and empty states.",
  "frontend/src/components/maui/residents/adl/index.ts": "Re-exports ADL dialog and history list components.",
  "frontend/src/components/maui/residents/EditResidentInformationDialog.tsx": "Dialog for editing resident information with dynamic lists, validation cleanup, and save handling.",
  "frontend/src/components/maui/residents/mar/AddMarRecordDialog.tsx": "Dialog form for adding MAR medication administration records tied to active medications.",
  "frontend/src/components/maui/residents/mar/index.ts": "Re-exports MAR dialog and history list components.",
  "frontend/src/components/maui/residents/mar/MarHistoryList.tsx": "Lists, sorts, and supports deletion of MAR records with date/time formatting.",
  "frontend/src/components/maui/residents/medications/AddMedicationDialog.tsx": "Dialog for adding a medication to a resident, including dosage, route, schedule, prescriber, and notes.",
  "frontend/src/components/maui/residents/medications/EditMedicationDialog.tsx": "Dialog component for editing medication details, managing form state, and submitting updates.",
  "frontend/src/components/maui/residents/medications/index.ts": "Barrel file exporting medication-related dialog and selector components.",
  "frontend/src/components/maui/residents/medications/MedicationPhysicianSelect.tsx": "Select component for choosing a prescribing physician with fallback to text input when none exist.",
  "frontend/src/components/maui/residents/medications/MedicationRouteSelect.tsx": "Select component for medication administration routes, including support for custom 'other' entries.",
  "frontend/src/components/maui/residents/medications/MedicationRowActions.tsx": "Action buttons and confirmation dialogs for editing, discontinuing, resuming, or deleting a medication.",
  "frontend/src/components/maui/residents/ResidentCard.tsx": "Card UI showing a resident’s summary with view, status toggle, and delete actions.",
  "frontend/src/components/maui/residents/ResidentDashboardHeader.tsx": "Header section for the resident dashboard with title and an add‑resident button.",
  "frontend/src/components/maui/residents/ResidentFilterSortBar.tsx": "Toolbar providing room filtering and sorting options for the resident list.",
  "frontend/src/components/maui/residents/ResidentGrid.tsx": "Displays a grid of ResidentCard components or an empty state when no residents match filters.",
  "frontend/src/components/maui/residents/ResidentKpiRow.tsx": "Shows KPI cards for total, active, and discharged resident counts.",
  "frontend/src/components/maui/residents/ResidentStatusTabs.tsx": "Provides tab-based filtering for resident status: All, Active, or Discharged.",
  "frontend/src/components/maui/residents/vitals/RecordDailyVitalsDialog.tsx": "Dialog for recording a resident's daily vitals, validating inputs, and submitting a vitals entry.",
  "frontend/src/components/maui/residents/vitals/VitalsHistoryList.tsx": "Displays a resident's vitals history with formatted entries and delete confirmation flow.",
  "frontend/src/components/references/MissingReferencePlaceholder.tsx": "UI placeholder showing missing reference materials and listing required sections.",
  "frontend/src/hooks/residentQueryKeys.ts": "Defines factory functions for resident-related React Query keys scoped by principal ID.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useHealthCheck.ts": "Runs a timed health check using an anonymous actor and exposes a derived status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identities, and status management.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend operations in React Query hooks for user profiles, residents directory access, and related functionality.",
  "frontend/src/index.css": "Defines Tailwind-based global styles, color themes, and print-specific styling.",
  "frontend/src/lib/brand.ts": "Exports static branding constants such as site name and logo path.",
  "frontend/src/lib/medicationRoutes.ts": "Defines medication route options and helpers to convert, parse, and format route values.",
  "frontend/src/lib/medications.ts": "Utility functions for updating, deleting, toggling, filtering, and generating IDs for medications.",
  "frontend/src/lib/utils.ts": "Exports a utility function to merge Tailwind class names.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/maui/Dashboard.tsx": "Dashboard component that loads resident directory data, applies filters and sorting, computes KPIs, and handles resident deletion and status toggling.",
  "frontend/src/pages/maui/residents/mockResidentMedications.ts": "Provides mock medication data for residents, with special entries for resident ID 3 and a default fallback.",
  "frontend/src/pages/maui/residents/mockResidentProfileData.ts": "Defines resident profile data structures and returns fallback mock profile data when backend data is unavailable.",
  "frontend/src/pages/maui/residents/mockResidents.ts": "Contains mock resident directory entries with basic demographic and medication counts.",
  "frontend/src/pages/maui/residents/residentAge.ts": "Utility functions for calculating and formatting a resident’s age from a birthdate.",
  "frontend/src/pages/maui/residents/residentDirectoryViewModel.ts": "Converts backend resident records into UI view models, formatting age, room, and status fields.",
  "frontend/src/pages/maui/residents/residentListUtils.ts": "Utility methods for filtering, sorting, and summarizing resident view models, including KPI and room extraction.",
  "frontend/src/pages/maui/residents/ResidentProfile.tsx": "Displays a resident’s full profile with backend or mock data and supports editing info, managing medications, and recording vitals, MAR, and ADL entries.",
  "frontend/src/pages/maui/residents/ResidentProfilePrintReport.tsx": "Generates a printable resident profile report including demographics, insurance details, and medication list.",
  "frontend/src/pages/references/MoritzReferenceCapture.tsx": "React page listing required screenshot and design references for recreating the Maui Lane Care Home UI, organized into categories with icons and status tags.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters (including hash routing), persisting them in sessionStorage, and clearing them from the URL.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and container settings with plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing the Maui Lane Care Home build, architecture notes, known issues, existing features, and generated assets."
}