{
  "backend/main.mo": "Defines data models and maps for residents, user profiles, and medical records, plus access control and helper logic for authorization. Resident management and CRUD operations are partially implemented but truncated.",
  "feature_evidence.json": "Feature evidence report listing branding and favicon update features with associated files, components, tests, and metadata.",
  "frontend-file-summaries.txt": "JSON-style list of concise summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind-based design system defining color tokens, theming variables, and dark mode overrides for Maui Lane Care Home.",
  "frontend/index.html": "HTML entry point setting page metadata, linking new favicon and touch icons, and loading the React app.",
  "frontend/src/App.tsx": "Main React entry component configuring TanStack Router, React Query, authentication gating, and route definitions.",
  "frontend/src/components/auth/ProtectedGate.tsx": "Authentication wrapper that displays a login card with BrandLogo for unauthenticated users and renders children once identity is established.",
  "frontend/src/components/brand/BrandLogo.tsx": "Brand logo component that loads the configured logo asset with error fallback to initials.",
  "frontend/src/components/maui/MauiAppShell.tsx": "Application shell with header, BrandLogo, navigation, content outlet, and sign‑out handling that clears identity and query cache.",
  "frontend/src/components/maui/MauiNav.tsx": "Navigation bar showing a single Dashboard tab with active state highlighting.",
  "frontend/src/components/maui/residents/AddNewResidentDialog.tsx": "Dialog component for creating a new resident with full form data, nested sections, validation handling, and mutation submission.",
  "frontend/src/components/maui/residents/adl/AddAdlRecordDialog.tsx": "Dialog for adding a new ADL record with validation, identity checks, and mutation submission.",
  "frontend/src/components/maui/residents/adl/AdlHistoryList.tsx": "Displays a resident’s ADL records with sorting, loading states, and delete confirmation functionality.",
  "frontend/src/components/maui/residents/adl/index.ts": "Re-exports ADL dialog and history list components.",
  "frontend/src/components/maui/residents/EditResidentInformationDialog.tsx": "Dialog for editing existing resident info, supporting validation, dynamic physician fields, and save actions.",
  "frontend/src/components/maui/residents/mar/AddMarRecordDialog.tsx": "Dialog for creating a new MAR record, including medication selection, time entry, validation, and submission.",
  "frontend/src/components/maui/residents/mar/index.ts": "Re-exports MAR dialog and history list components.",
  "frontend/src/components/maui/residents/mar/MarHistoryList.tsx": "Displays MAR records with date/time formatting, delete support, and empty/loading states.",
  "frontend/src/components/maui/residents/medications/AddMedicationDialog.tsx": "Dialog for adding a new medication, supporting multiple times, validation, and submission callbacks.",
  "frontend/src/components/maui/residents/medications/index.ts": "Re-exports the AddMedicationDialog component.",
  "frontend/src/components/maui/residents/ResidentCard.tsx": "Displays a resident summary card with profile, status toggle, and delete actions.",
  "frontend/src/components/maui/residents/ResidentDashboardHeader.tsx": "Header bar for the resident dashboard with title and add‑resident button.",
  "frontend/src/components/maui/residents/ResidentFilterSortBar.tsx": "UI bar for filtering residents by room and sorting by room, name, or age.",
  "frontend/src/components/maui/residents/ResidentGrid.tsx": "Grid layout rendering resident cards or an empty‑state message when none match filters.",
  "frontend/src/components/maui/residents/ResidentKpiRow.tsx": "Displays KPI cards showing totals for residents, active residents, and discharged residents.",
  "frontend/src/components/maui/residents/ResidentStatusTabs.tsx": "Tabs for filtering residents by All, Active, or Discharged status.",
  "frontend/src/components/maui/residents/vitals/RecordDailyVitalsDialog.tsx": "Dialog for entering and submitting daily vitals, including timestamp creation, unit conversion, and validation.",
  "frontend/src/components/maui/residents/vitals/VitalsHistoryList.tsx": "Displays a resident's vitals history with sorting, deletion, and status indicators for oxygen levels.",
  "frontend/src/components/references/MissingReferencePlaceholder.tsx": "Renders a placeholder card listing missing reference materials with links and alert messaging.",
  "frontend/src/hooks/residentQueryKeys.ts": "Provides consistent, principal-scoped React Query keys for resident-related caching.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context with login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks wrapping backend calls for user profiles, residents, and vitals data.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom themes, dark mode variables, and print-friendly styles.",
  "frontend/src/lib/brand.ts": "Exports branding constants including the logo path and facility name.",
  "frontend/src/lib/utils.ts": "Utility function for merging Tailwind class names using clsx and twMerge.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and Internet Identity providers before rendering App.",
  "frontend/src/pages/maui/Dashboard.tsx": "Dashboard page fetching residents, converting them to view models, applying filters/sorting, computing KPIs, and handling resident deletion/status toggling.",
  "frontend/src/pages/maui/residents/mockResidentMedications.ts": "Provides mock medication data for residents, including a special case for resident ID 3.",
  "frontend/src/pages/maui/residents/mockResidentProfileData.ts": "Defines resident profile types and returns fallback mock profile data when backend data is unavailable.",
  "frontend/src/pages/maui/residents/mockResidents.ts": "Contains mock resident directory entries with basic demographic and care-related fields.",
  "frontend/src/pages/maui/residents/residentDirectoryViewModel.ts": "Transforms backend resident records into UI-friendly view models, including age and room formatting.",
  "frontend/src/pages/maui/residents/residentListUtils.ts": "Utility functions for filtering, sorting, KPI computation, and extracting unique rooms from resident view models.",
  "frontend/src/pages/maui/residents/ResidentProfile.tsx": "Displays detailed resident profile with backend or mock data, supports vitals/MAR/ADL entries, medication management, and editing/printing profile data.",
  "frontend/src/pages/maui/residents/ResidentProfilePrintReport.tsx": "Print-only component rendering resident info, insurance details, and medication list in a formatted report layout.",
  "frontend/src/pages/references/MoritzReferenceCapture.tsx": "Renders a reference checklist outlining required screenshots and design details for UI recreation.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from URL or storage.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, typography, container queries, animations, and extended theme settings.",
  "project_state.json": "Project state metadata describing existing features, versions, and the goal of cloning the Moritz Care Home app for Maui Lane."
}