{
  "backend/main.mo": "Minimal Motoko canister actor with no methods.",
  "feature_evidence.json": "Feature evidence report specifying UI text replacement and listing affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of auto‑generated summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base styles and OKLCH color tokens defining light/dark themes and global design variables.",
  "frontend/index.html": "HTML entry point setting the Maui Lane Care Home title, favicon, root mount point, and main script.",
  "frontend/src/App.tsx": "Root React app configuring TanStack Router, React Query, authentication gate, and main routes.",
  "frontend/src/components/auth/ProtectedGate.tsx": "Authentication wrapper that shows a login screen until Internet Identity login completes.",
  "frontend/src/components/maui/MauiAppShell.tsx": "Main layout shell providing header, navigation, footer, and content outlet with sign‑out support.",
  "frontend/src/components/maui/MauiNav.tsx": "Top navigation bar with Dashboard and Reference Capture links and active route highlighting.",
  "frontend/src/components/maui/residents/AddNewResidentDialog.tsx": "Dialog for adding a new resident with extensive multi‑section form state and validation handling.",
  "frontend/src/components/maui/residents/EditResidentInformationDialog.tsx": "Dialog for editing resident information with form validation, physician list editing, and save handling.",
  "frontend/src/components/maui/residents/ResidentCard.tsx": "Displays a resident card with details, status badges, and actions like view, discharge, and delete.",
  "frontend/src/components/maui/residents/ResidentDashboardHeader.tsx": "Header component showing the residents page title and an add-resident button.",
  "frontend/src/components/maui/residents/ResidentFilterSortBar.tsx": "Provides UI controls for filtering residents by room and sorting by room, name, or age.",
  "frontend/src/components/maui/residents/ResidentGrid.tsx": "Renders a responsive grid of ResidentCard components or an empty-state message.",
  "frontend/src/components/maui/residents/ResidentKpiRow.tsx": "Shows KPI cards for total, active, and discharged residents.",
  "frontend/src/components/maui/residents/ResidentStatusTabs.tsx": "Tab selector for filtering residents by status: All, Active, or Discharged.",
  "frontend/src/components/references/MissingReferencePlaceholder.tsx": "Displays a placeholder card listing missing reference materials with a link to a full checklist.",
  "frontend/src/hooks/useActor.ts": "Creates and maintains a backend actor based on Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for Internet Identity authentication, including login, logout, and stored identity handling.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query hooks interacting with the backend.",
  "frontend/src/index.css": "Tailwind base styles with custom light/dark themes and print-specific styling.",
  "frontend/src/lib/utils.ts": "Utility function for merging Tailwind class names using clsx and twMerge.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/maui/Dashboard.tsx": "Implements the resident dashboard with filtering, sorting, KPIs, and add-resident dialog using mock data.",
  "frontend/src/pages/maui/residents/mockResidentMedications.ts": "Provides mock medication data and a helper to fetch medications for a given resident.",
  "frontend/src/pages/maui/residents/mockResidentProfileData.ts": "Generates a mock detailed resident profile based on basic resident info including physicians, pharmacy, and insurance.",
  "frontend/src/pages/maui/residents/mockResidents.ts": "Defines mock resident list data used for the dashboard and profile lookups.",
  "frontend/src/pages/maui/residents/residentListUtils.ts": "Contains filtering, sorting, KPI computation, and room extraction utilities for resident lists.",
  "frontend/src/pages/maui/residents/ResidentProfile.tsx": "Displays a resident's full profile with tabs, medications, editing, and print functionality using mocked data.",
  "frontend/src/pages/maui/residents/ResidentProfilePrintReport.tsx": "Renders a printable resident profile report including personal, insurance, and medication details.",
  "frontend/src/pages/references/MoritzReferenceCapture.tsx": "Displays a structured checklist of reference materials required to recreate the Maui Lane Care Home UI.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom OKLCH color variables, extended theme settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing build goals and a list of implemented features for the Maui Lane Care Home application."
}