{
  "kind": "build_request",
  "title": "Fix app getting stuck on “Connecting to Backend” after “Loading Profile” by eliminating actor/health-check race conditions",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Prevent any resident/profile React Query calls from executing until the backend actor is fully initialized and stable, so the app cannot enter a stuck “Connecting to Backend” state immediately after the profile finishes loading.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "stucked on connecting to backend after it swys loading profile",
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "When the user signs in and the app finishes “Loading Profile”, the UI proceeds into the app without switching back to “Connecting to Backend”.",
        "No React Query request should throw an \"Actor not available\" error during initial load or when navigating to ResidentProfile.",
        "ResidentProfile data fetching does not start until the actor is available (and any required identity prerequisites are satisfied)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Stabilize the startup gating flow so BackendReachabilityGate and ProfileBootstrapGate do not re-trigger in a loop (or remount in a way that re-runs health checks indefinitely) after profile load and during route transitions (e.g., navigating to the Medication tab / ResidentProfile page).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "stucked on connecting to backend after it swys loading profile"
        ]
      },
      "acceptanceCriteria": [
        "After successful initial backend reachability and profile bootstrap, navigating between routes (including ResidentProfile and tabs like Medications) does not show the full-screen “Connecting to Backend” gate again unless the backend is actually unreachable.",
        "If the backend is unreachable, the user sees the existing error UI with a working Retry button; if reachable, the app transitions to content and stays there.",
        "Health check behavior does not cause infinite loading states; it either resolves to reachable/unreachable within its timeout and surfaces a clear error message on failure."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui or any paths listed in frontend.immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep all backend logic in the single Motoko actor (backend/main.mo) if backend changes are required; add backend/migration.mo only if state migration is necessary.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new product features unrelated to startup connectivity (e.g., new tabs, new resident workflows).",
    "Introducing external auth providers, databases, or real-time transports."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}