{
  "kind": "build_request",
  "title": "Make resident profiles visible to other users",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update backend authorization so that authenticated users can view all resident directory entries and load resident profiles created by other users (cross-user visibility), while keeping write operations (update, delete, toggle status, and adding clinical records) restricted to the resident owner or an admin.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "resident profiles not ahowing on other users"
        ]
      },
      "acceptanceCriteria": [
        "When User A creates a resident, User B (non-admin) can see that resident in the residents dashboard directory list.",
        "When User B navigates to the resident profile page for a resident created by User A, the profile loads successfully (no unauthorized trap).",
        "User B cannot update/delete/toggle-status for a resident owned by User A (backend rejects the operation), unless User B is an admin.",
        "Owner and admin behavior remains unchanged: the owner and admins can still view and modify residents as before."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the frontend residents dashboard and resident profile pages correctly display residents returned by the backend for the signed-in user, including residents created by other users; if a backend authorization error occurs, show an English error message that clearly indicates the user does not have permission to edit/delete that resident.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "resident profiles not ahowing on other users"
        ]
      },
      "acceptanceCriteria": [
        "After the backend change, the dashboard resident grid shows residents created by other users without requiring a hard refresh.",
        "Attempting a disallowed action (edit/delete/toggle status) on a resident not owned by the current user results in a clear English error toast/message (e.g., indicating insufficient permission) and does not break the page.",
        "Resident profile view continues to render using backend data when available and does not silently fall back to mock data for valid resident IDs."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Implementing group/facility membership, invitations, or role management UI beyond existing admin/user behavior.",
    "Adding third-party authentication or non-Internet-Identity login methods."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}