{
  "kind": "build_request",
  "title": "Rollback production to Version 46 (redeploy v46 behavior)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-20",
      "text": "Restore the codebase to match the behavior of Version 46 and remove/undo the Version 47 changes that caused the immediate Residents dashboard failure (\"Failed to load residents. Please try again.\" with no data rendered).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "deploy version 46 to production again"
        ]
      },
      "acceptanceCriteria": [
        "When logged in with Internet Identity, the Maui Dashboard loads without the generic error banner and renders the residents directory content (grid/KPIs) successfully.",
        "Opening a resident profile does not cause the residents directory query to immediately fail on subsequent navigation back to the dashboard.",
        "No resident-directory backend call traps or returns an unauthorized/malformed response for a valid authenticated staff user in the normal happy path."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Update the app version marker(s) used by the project to reflect Version 46 for the rollback release (including frontend/public/version.txt).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "deploy version 46 to production again"
        ]
      },
      "acceptanceCriteria": [
        "frontend/public/version.txt contains \"46\" after the change.",
        "A production build serves the updated version marker file with the value \"46\"."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Produce a production deployment build that corresponds to the Version 46 rollback and is suitable for deploying to production using the existing build/deploy tooling in the repo.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "deploy version 46 to production again"
        ]
      },
      "acceptanceCriteria": [
        "A clean install + build completes successfully for both frontend and backend using the repository’s existing tooling.",
        "The resulting artifacts/canister state (as applicable) correspond to the rollback code intended to replicate Version 46 behavior."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add/modify backend/migration.mo if required by state upgrade policy.",
    "Do not edit files under frontend/src/components/ui or any paths listed in frontend.immutablePaths; compose existing UI components instead."
  ],
  "nonGoals": [
    "Implementing new residents features beyond restoring Version 46 behavior.",
    "Adding new authentication providers or changing Internet Identity behavior.",
    "Redesigning the Maui Lane UI/branding as part of this rollback."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}