{
  "kind": "build_request",
  "title": "Enable editing resident information from the Resident Profile page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Add an \"Edit\" action on the resident profile page (frontend/src/pages/maui/residents/ResidentProfile.tsx) that opens the existing EditResidentInformationDialog and allows updating the currently-viewed resident’s information.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "allow edit on the resident's profile"
        ]
      },
      "acceptanceCriteria": [
        "When viewing a resident profile that is backed by a valid resident Principal ID, the page shows an Edit button in the header area near the existing \"Print Report\" action.",
        "Clicking the Edit button opens the existing dialog component (frontend/src/components/maui/residents/EditResidentInformationDialog.tsx).",
        "The dialog is pre-filled with the current resident data from the backend (useGetResident)."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Wire the EditResidentInformationDialog save action on the resident profile page to the existing updateResident backend mutation (useUpdateResident) and refresh the profile view after a successful save.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "allow edit on the resident's profile"
        ]
      },
      "acceptanceCriteria": [
        "Saving changes in the dialog calls the existing React Query mutation (useUpdateResident) with the current residentId and a ResidentUpdateRequest derived from the dialog values.",
        "After a successful save, the resident profile displays the updated values without requiring a manual page reload (query invalidation/refetch is acceptable).",
        "If the backend update fails, the UI shows a clear error message in English (e.g., \"Failed to save changes. Please try again.\") and does not close the dialog automatically."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Ensure the resident update request preserves backend-only fields not editable in the dialog (e.g., insurance, responsible persons, medications) by reusing the existing backendResident values when constructing the ResidentUpdateRequest.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "allow edit on the resident's profile"
        ]
      },
      "acceptanceCriteria": [
        "Updating basic fields from the dialog (name, birth date, admission date, room number, room type, Medicaid number, Medicare number, physicians, pharmacy fields) does not overwrite other resident fields with empty/default values in the backend.",
        "The resident’s active/discharged status is not unintentionally changed by saving profile edits (status toggling remains controlled by the existing status toggle flow)."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (read-only UI component sources must be composed, not edited).",
    "Respect the existing single-actor Motoko architecture; do not introduce additional backend canisters."
  ],
  "nonGoals": [
    "Implementing edit flows for MAR/ADL/Vitals records from the resident profile (beyond existing create/delete functionality).",
    "Adding new backend resident fields (e.g., bed) that are not currently present in backend Resident/ResidentUpdateRequest types."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}