{
  "kind": "build_request",
  "title": "Fix medication edit error and add dropdown selectors for Administration Route and Prescribing Physician",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-37",
      "text": "Review and fix the runtime error that occurs when editing and saving a resident medication from the Resident Profile medications list, ensuring the edit dialog can save without crashing and the backend mutation completes successfully.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "review and fix error on editing medications. add drop down selector for Administration Route and Prescribing Physician"
        ]
      },
      "acceptanceCriteria": [
        "Editing an existing medication and clicking “Save Changes” does not throw a runtime error in the browser console.",
        "If the backend update fails, the UI shows a clear error toast and does not crash.",
        "If the backend update succeeds, the UI shows a success toast and the updated medication values are visible after refetch/reload.",
        "The prescribing physician selector in the edit dialog does not use an empty-string Select value that can break the Select component (use a safe sentinel value and map it to an empty physician value)."
      ]
    },
    {
      "id": "REQ-38",
      "text": "Add a dropdown selector input for Medication Administration Route in both the Add Medication and Edit Medication dialogs, using a consistent predefined list of common routes, while still allowing an optional/blank selection.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "add drop down selector for Administration Route"
        ]
      },
      "acceptanceCriteria": [
        "Add Medication dialog uses a Select control (not a free-text input) for Administration Route.",
        "Edit Medication dialog includes the same Administration Route Select control and is pre-populated with the current medication route.",
        "The selected route is persisted to the backend as part of the resident medication record and is retained after reload.",
        "Existing residents/medications stored before this change continue to load successfully; medications without a stored route display a blank/unset route in the UI."
      ]
    },
    {
      "id": "REQ-39",
      "text": "Add a dropdown selector input for Prescribing Physician in both the Add Medication and Edit Medication dialogs, sourcing options from the resident’s existing Physicians list; ensure the field can be left unset.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "add drop down selector for ... Prescribing Physician"
        ]
      },
      "acceptanceCriteria": [
        "Add Medication dialog uses a Select control for Prescribing Physician when the resident has physicians on file, and supports an explicit “None/Unassigned” selection.",
        "Edit Medication dialog continues to use a Select control for Prescribing Physician (when physicians exist) and does not crash when selecting “None/Unassigned”.",
        "If the resident has no physicians on file, the UI provides a safe fallback (e.g., disabled Select with a message, or a text input) without causing runtime errors.",
        "The saved prescribing physician value is persisted and displayed correctly after reload."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; add backend/migration.mo changes only if existing stable state needs to be upgraded for new medication fields.",
    "Do not edit files under frontend/src/components/ui or the immutable hook paths listed in SYSTEM_CONTEXT (compose existing components instead).",
    "Use English for all user-facing UI text."
  ],
  "nonGoals": [
    "Changing MAR record schema or MAR add flow behavior beyond what is required for medication field compatibility.",
    "Adding third-party physician directories or external data sources for routes/physicians.",
    "Introducing new authentication mechanisms beyond the existing Internet Identity flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}