{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Enable editing resident information from the Resident Profile page",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Add an Edit action on ResidentProfile to open the existing EditResidentInformationDialog pre-filled from useGetResident for the currently viewed resident.",
      "acceptanceCriteria": [
        "When viewing a resident profile that is backed by a valid resident Principal ID, the page shows an Edit button in the header area near the existing \"Print Report\" action.",
        "Clicking the Edit button opens the existing dialog component (frontend/src/components/maui/residents/EditResidentInformationDialog.tsx).",
        "The dialog is pre-filled with the current resident data from the backend (useGetResident)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/maui/residents/ResidentProfile.tsx",
          "operation": "modify",
          "description": "Add local state to control EditResidentInformationDialog visibility; render an \"Edit\" button near the existing \"Print Report\" action when residentId parses to a valid Principal and backendResident is available; derive dialog initialValues from backendResident returned by useGetResident (including splitting backendResident.name into first/last name for the dialog and mapping physicians/pharmacy/room fields). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/maui/residents/EditResidentInformationDialog.tsx",
          "operation": "modify",
          "description": "Adjust dialog behavior to support being opened from ResidentProfile with backend-provided initialValues (e.g., keep form reset-on-open behavior) and allow parent-controlled closing on successful save (do not force-close the dialog inside the dialog component). Add a place to render an externally-provided save error message (optional prop) so ResidentProfile can show backend save failures without closing. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Wire dialog save to useUpdateResident and refresh the resident profile view after successful update; show a clear error on failure and keep the dialog open.",
      "acceptanceCriteria": [
        "Saving changes in the dialog calls the existing React Query mutation (useUpdateResident) with the current residentId and a ResidentUpdateRequest derived from the dialog values.",
        "After a successful save, the resident profile displays the updated values without requiring a manual page reload (query invalidation/refetch is acceptable).",
        "If the backend update fails, the UI shows a clear error message in English (e.g., \"Failed to save changes. Please try again.\") and does not close the dialog automatically."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/maui/residents/ResidentProfile.tsx",
          "operation": "modify",
          "description": "Integrate useUpdateResident in ResidentProfile; implement an onSave handler passed to EditResidentInformationDialog that builds a ResidentUpdateRequest from dialog values and calls the mutation with the current residentPrincipal; on success, close the dialog and rely on existing query invalidation/refetch to refresh displayed data; on error, keep dialog open and surface an English error message via dialog props/UI state. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/maui/residents/EditResidentInformationDialog.tsx",
          "operation": "modify",
          "description": "Support parent-driven save flow by allowing onSave to be async (or by not auto-closing) and showing a parent-provided error message; optionally support a saving/disabled state for the Save button so the dialog can reflect mutation progress from ResidentProfile. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Preserve backend-only / non-editable resident fields when constructing ResidentUpdateRequest, and avoid unintentionally changing active/discharged status during profile edits.",
      "acceptanceCriteria": [
        "Updating basic fields from the dialog (name, birth date, admission date, room number, room type, Medicaid number, Medicare number, physicians, pharmacy fields) does not overwrite other resident fields with empty/default values in the backend.",
        "The resident’s active/discharged status is not unintentionally changed by saving profile edits (status toggling remains controlled by the existing status toggle flow)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/maui/residents/ResidentProfile.tsx",
          "operation": "modify",
          "description": "When building the ResidentUpdateRequest for useUpdateResident, merge editable fields from the dialog with the existing backendResident values for non-editable fields (e.g., insurance, responsiblePersons, medications) so they are preserved; ensure the dialog's status/bed UI values (if present) do not drive any backend updates, and do not trigger resident active/discharged changes from this save flow. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}