{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Cross-user resident visibility: frontend directory + profile rendering and permission error messaging",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Ensure dashboard and resident profile render backend-provided residents (including cross-user) and show clear English permission errors for disallowed write actions without falling back to mock data for valid IDs.",
      "acceptanceCriteria": [
        "After the backend change, the dashboard resident grid shows residents created by other users without requiring a hard refresh.",
        "Attempting a disallowed action (edit/delete/toggle status) on a resident not owned by the current user results in a clear English error toast/message (e.g., indicating insufficient permission) and does not break the page.",
        "Resident profile view continues to render using backend data when available and does not silently fall back to mock data for valid resident IDs."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/backendErrorMessage.ts",
          "operation": "create",
          "description": "Add a small helper to translate backend failures (including authorization traps) into clear English UI messages (e.g., insufficient permission to edit/delete). Use this helper anywhere resident mutations/queries surface errors. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update resident-related React Query hooks to (1) normalize backend authorization failures into clear English Error messages (using the new backendErrorMessage helper) for delete/toggle/update/medication writes, and (2) ensure the residents directory query does not remain stuck on a cached pre-change result (e.g., by forcing refetch-on-mount and/or reducing stale caching) so cross-user residents appear without a hard refresh. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/maui/Dashboard.tsx",
          "operation": "modify",
          "description": "Ensure dashboard actions (delete/toggle) surface friendly permission-specific toast messages when backend rejects cross-user write attempts, using the shared backendErrorMessage helper; keep the page stable (no crashes) on auth errors. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/maui/residents/ResidentProfile.tsx",
          "operation": "modify",
          "description": "Stop silently falling back to mock resident profile data when the residentId is a valid Principal but backend data is missing/unauthorized; instead show an explicit error/not-found UI and keep rendering backend data when available. Also ensure edit/medication write attempts display clear English permission errors when rejected (and optionally disable write controls when the viewer is not the resident owner, based on backendResident.owner vs current identity). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}