{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Harden frontend actor initialization errors and add backend health-check diagnostics on Dashboard",
  "requirements": [
    {
      "id": "REQ-28",
      "summary": "Make actor creation resilient by capturing actor/initialization failures in useActor and surfacing actionable error + retry to the UI.",
      "acceptanceCriteria": [
        "If actor creation or `_initializeAccessControlWithSecret` fails, the failure is captured and surfaced to the app (e.g., via an error state returned by `useActor`) rather than only resulting in `actor: null`.",
        "Dashboard no longer shows the generic 'Backend connection is not available...' state when the underlying issue is an initialization trap; instead, it shows an actionable error message that includes the actual error message text (English) and offers retry/refresh.",
        "Retrying after a transient failure (e.g., reload or retry button) re-attempts actor creation and recovers without requiring a code redeploy."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Extend the actor React Query to be failure-aware: catch and expose actor/initialization errors (e.g., createActorWithConfig and access-control initialization), return a structured state (actor, isFetching, error, and a retry/refetch function) so consumers can render a clear connectivity/auth message instead of treating failures as only `actor: null`. Use the existing core-infrastructure actor factory (`createActorWithConfig`) and follow authorization component guidance for post-login initialization; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/maui/Dashboard.tsx",
          "operation": "modify",
          "description": "Update Dashboard to consume the new `useActor` error state and render an actionable English error UI when actor creation/initialization fails, including the actual caught error message text and keeping existing actions (Retry/Refresh). Wire the Retry action to re-attempt actor creation (via the `useActor` retry/refetch) in addition to refetching the directory query when relevant; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Add a lightweight Dashboard diagnostic that calls backend healthCheck() to distinguish unreachable canister vs authenticated initialization/authorization failure and reflect that in the error UI.",
      "acceptanceCriteria": [
        "When authenticated queries fail, the app can optionally perform a `healthCheck()` call and display one of: (a) backend reachable (health check ok) but user initialization/authorization failed, or (b) backend unreachable/timeout.",
        "User-facing error text is in English and does not mention internal method names unless included in the caught error message.",
        "The existing Dashboard error actions (Retry / Refresh Page) remain available and functional."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useHealthCheck.ts",
          "operation": "create",
          "description": "Create a small React Query hook that performs an unauthenticated `healthCheck()` using an anonymous actor (via core-infrastructure `createActorWithConfig`) with simple timeout/error handling, returning a status that callers can use to classify failures as reachable vs unreachable; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/maui/Dashboard.tsx",
          "operation": "modify",
          "description": "Incorporate the health-check diagnostic into the existing Dashboard error UI paths: when authenticated data queries fail or when actor initialization fails, optionally trigger the unauthenticated health-check and display either (a) 'Backend reachable, but your account may not be initialized/authorized yet' or (b) 'Backend appears unreachable/timeout', while preserving the existing Retry/Refresh actions and ensuring displayed text is English and avoids internal method names unless they appear in the caught error message; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}