{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-05T03:17:34.720Z",
  "summary": "The diff shows initial wiring for an edit dialog flow on ResidentProfile and significant changes to EditResidentInformationDialog, but the key acceptance-criteria behaviors (Edit button placement/visibility, save wiring to useUpdateResident with correct request construction, refetch/invalidation, and error handling) are not verifiable from the truncated snippets. The dialog also introduces new form fields (e.g., bed) that were explicitly called out as non-goals.",
  "missing_requirements": [
    {
      "id": "REQ-12",
      "requirement": "Add an \"Edit\" action on the resident profile page that opens the existing EditResidentInformationDialog and is pre-filled with current backend data (useGetResident).",
      "reason": "ResidentProfile imports the dialog and tracks isEditDialogOpen, but the truncated diff does not include the header JSX showing an Edit button near \"Print Report\" nor the dialog invocation with initialValues derived from useGetResident.",
      "evidence": [
        "frontend/src/pages/maui/residents/ResidentProfile.tsx"
      ]
    },
    {
      "id": "REQ-13",
      "requirement": "Wire dialog save to useUpdateResident and refresh the profile after successful save; show an English error and keep dialog open on failure.",
      "reason": "ResidentProfile shows useUpdateResident() and a handleEditSave() stub with an invalid-ID toast, but the truncated diff does not show calling the mutation with (residentId, ResidentUpdateRequest), any query invalidation/refetch, or failure handling that keeps the dialog open with a clear error message.",
      "evidence": [
        "frontend/src/pages/maui/residents/ResidentProfile.tsx"
      ]
    },
    {
      "id": "REQ-14",
      "requirement": "Preserve backend-only fields when constructing ResidentUpdateRequest (reuse existing backendResident values) and avoid unintentional status changes.",
      "reason": "The diff snippet does not show how ResidentUpdateRequest is constructed; therefore it is not verifiable that backend-only fields are preserved or that active/discharged status is not altered during profile edits.",
      "evidence": [
        "frontend/src/pages/maui/residents/ResidentProfile.tsx"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Added a \"bed\" field to EditResidentFormData (and likely to the dialog UI).",
      "reason": "BuildRequest explicitly lists adding new backend resident fields like \"bed\" as a non-goal; introducing this field in the edit form suggests an unrequested edit surface that may not exist in backend Resident/ResidentUpdateRequest.",
      "evidence": [
        "frontend/src/components/maui/residents/EditResidentInformationDialog.tsx"
      ]
    },
    {
      "description": "Added a \"status\" field to EditResidentFormData (and likely to the dialog UI).",
      "reason": "Requirements state resident active/discharged status should not be unintentionally changed by saving profile edits and should remain controlled by the existing status toggle flow; adding an editable status field is unrequested and risks violating that constraint.",
      "evidence": [
        "frontend/src/components/maui/residents/EditResidentInformationDialog.tsx"
      ]
    }
  ],
  "confidence": 0.58,
  "changed_files": [
    "frontend-file-summaries.txt",
    "frontend/src/components/maui/residents/EditResidentInformationDialog.tsx",
    "frontend/src/pages/maui/residents/ResidentProfile.tsx",
    "project_state.json"
  ]
}